[
    {
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Change Management Policy and Procedures",
        "Control ID": "CCC-01",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain\n policies and procedures for managing the risks associated with applying changes\n to organization assets, including application, systems, infrastructure, configuration,\n etc., regardless of whether the assets are managed internally or externally\n (i.e., outsourced). Review and update the policies and procedures at least annually.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This control's implementation responsibility is shared for both CSP and CSC, however, each should implement this control independently from one another. The change management policy and procedures should be managed and baselined independently by each party, the CSP and CSC within their respective corporate business needs, requirements and in alignment with industry standards.\n \n Implementation Guidelines.\n Applicable to all service models:\n Establishing robust change control and configuration management processes is essential for CSPs to ensure the stability, security, and reliability of their cloud services. Change control processes ensure that changes to the cloud environment are carefully planned, reviewed, approved, and implemented in a controlled manner. This helps prevent unauthorized or unintended changes that could disrupt service delivery or compromise security. Configuration management processes, on the other hand, focus on maintaining consistent and accurate configurations across the cloud environment, ensuring that systems are properly configured and compliant with security standards and business requirements.\n The CSP has responsibility for the design, implementation, and management of all supporting infrastructure — virtual elastic compute, server operating systems, storage, and networking — and also middleware, development tools, business intelligence services, and database management systems. A change management process should be in operation to ensure all proposed changes to the services consumed by the CSC are governed and subjected to formal procedures. Applications should be configured as contractually agreed upon.\n \n Policies should include (but not limited to) provisions on the following:\n a. Scope and Objectives: The scope, objectives, roles and responsibilities for the change management process and should be aligned with the organization's strategic goals, business requirements, and security policies, and comply with the relevant laws, regulations, and standards\n i. Create a Change Control Board (CCB) that is responsible for reviewing and approving all change requests\n ii. Form a dedicated change management team responsible for overseeing and executing the change management process\n iii. Assign clear roles and responsibilities for each phase of the change management process, such as change initiation, review, approval, implementation, testing, and post-implementation review\n iv. Define what constitutes a change, including configuration changes, software updates, hardware modifications,and data alterations\n b. Change Management Process: Requirements to establish a formal process outlining the change management workflow for managing changes to cloud computing assets should be defined\n c. Change Management Baseline: Requirements for the establishment and maintenance of a change management baseline which includes a standard and approved state of the organization assets that serves as a reference point for the changes. The change management baseline should be reviewed periodically to verify it is accurate and up-to-date\n d. Detection of Baseline Deviation: Requirements for the establishment of a detection baseline deviations process to monitor and audit the configuration of the organization assets regularly, and compare it with the change management baseline in order to detect and report any deviations or anomalies\n e. Exception Management: A process for managing exceptions to the change management policy and procedures. The procedures should include a process for requesting exceptions, reviewing exceptions, approving exceptions, and documenting them\n f. Change Risk Assessment: A risk assessment for all changes to cloud computing assets and ensuring that changes are made with a full understanding of the risks involved and that appropriate measures are taken to minimize those risks\n g. Quality Testing: A defined quality change control, approval and testing process with established baselines, testing, and release standards. The process should include a testing plan, test cases, and acceptance criteria\n h. Change Authorization: An authorization process for all changes to cloud computing assets are authorized and that legitimate changes are approved before they are implemented in production\n i. CSP and CSC Change Agreements: Requirements for change agreements that define the terms and conditions for the changes that directly impact the CSCs owned environments/tenants, such as the scope, frequency, timing, duration, notification, approval, and compensation of the changes\n j. Change Restoration: Change restoration requirements to revert the changes that cause or contribute to the incidents, errors, or deviations, and restore the cloud assets and their baseline configurations to their previous or desired state\n k. Approval: Approval requirements and senior management involvement to ensure alignment with the organization's strategic goals and risk appetite\n i. An approval process should be established for any changes or modifications to the policy and procedures\n ii. A documented record of approvals (including dates, names of approvers, and any relevant comments or discussions) should be maintained\n l. Communication: Effective communication of the policy and procedures should be facilitated to all relevant cloud stakeholders\n m. Maintenance and Reviews: The change control and configuration management policies and procedures should be documented, reviewed and updated at least annually to ensure alignment with evolving cloud security landscape and to reflect changes in cloud technology, regulations, and risks",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The CSC is responsible for establishing its own change management processes, including policies and procedures to ensure all proposed changes to contracted services are governed and subjected to formal processes including impact analysis, roll back upon change failure, and service threat/likelihood analyses so services will not suffer unexpected degradation or outage. Sufficiently skilled Change Managers should be appointed to review planned changes during formally scheduled review meetings.\n \n Implementation Guidelines.\n Given that the CSC manages all aspects of the applications lifecycle and business services developed using the supporting applications, the full documented and annually reviewed change management process should be in place for the application and data layers.\n \n The SaaS model expects the CSP to provide a complete software solution that the CSC purchases on a pay-as-you-go basis. The CSC is expected to manage the SaaS application security controls and endpoints connecting to the service.\n \n SaaS CSCs should consider a variety of secure configuration policy requirements and controls when managing their SaaS applications to protect their data. Here are some key areas to focus on:\n a. Access Controls: Securely configure access controls adhering to the PoLP to restrict access to SaaS applications sensitive data\n b. Strong Authentication: Enable multi-factor authentication (MFA) for all users to add an extra layer of security beyond just passwords\n c. Data Encryption: Configure encryption for both data at rest and data in transit to protect sensitive information from unauthorized access or breaches\n d. Default Configuration Hardening: Review and harden default configurations provided by the SaaS vendor to disable unnecessary features and reduce potential attack vectors\n e. Application Security Updates: Enable and apply security updates configurations promptly (automated where possible) to address vulnerabilities and protect against known exploits\n f. Third-Party Integrations: Scrutinize third-party integrations and ensure they comply with security best practices and do not introduce unnecessary risks\n g. Logging and Monitoring: Configure appropriate SaaS applications logging and monitoring for user activity, system events, and security-related incidents to detect anomalies and potential threats promptly\n \n Policies should include (but not limited to) provisions on the following:\n The policies provided for the CSP apply."
    },
    {
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Quality Testing",
        "Control ID": "CCC-02",
        "Control Specification": "Follow a defined quality change control, approval and testing process\n with established baselines, testing, and release standards.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This control's implementation responsibility is shared for both CSP and CSC, however, both should implement this control independently from one another. All quality change control processes and applied changes to systems should be independently baselined, tested, and approved according to their corporate policies and in line with industry standards.\n \n Implementation Guidelines.\n Applicable to all service models:\n The CSP should plan to test and review during the change management process. This plan should include test inputs and conditional outcomes. For internal development, the team that oversees change initially can perform such tests. Independent acceptance testing can then be performed to determine whether the system functions as intended.\n \n Testing records should be documented before implementing planned changes to organization assets. The record should comprise a test plan, configuration baseline before the change, test result, and new configuration baseline.\n \n Implementation best practices for this control include (but not limited to):\n a. Quality Change Control Baseline: \n i. Baselines with key performance indicators (KPIs) and security metrics should be established to assess the impact of changes and ensure that service quality and security are maintained\n ii. A quality change control process should be implemented to ensure that the changes are consistent, reliable, and compatible with the existing cloud environment configuration\n b. Testing Strategies: Comprehensive testing strategies should be developed that encompass unit testing, integration testing, performance testing, security testing, and user acceptance testing. Automated testing tools should be utilized whenever possible to streamline testing procedures and improve efficiency\n c. Release Standards: Release standards should be defined prior to releasing new features, updates, or patches to cloud services. These standards should address aspects such as code quality, compatibility, security vulnerabilities, and bug fixes\n d. Testing and Deployment Automation: Testing should verify that the changes meet the expected outcomes, performance, and functionality, and do not introduce any errors, defects, or vulnerabilities\n i. All changes to cloud computing assets should be tested in a non-production environment before implementing them in production\n ii. Testing processes should be automated where possible to reduce manual effort and expedite the testing cycle\n iii. Continuous integration (CI) and continuous delivery (CD) pipelines should be utilized to automate the deployment of changes to production environments\n e. User Acceptance Testing (UAT): UAT procedures should be implemented to involve end-users in testing changes. Feedback should be collected from end-users to ensure changes meet functional and usability requirements",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Change Management Technology",
        "Control ID": "CCC-03",
        "Control Specification": "Manage the risks associated with applying changes to organization\n assets, including application, systems, infrastructure, configuration, etc.,\n regardless of whether the assets are managed internally or externally (i.e.,\n outsourced).",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This control's implementation responsibility is shared for both CSP and CSC, however, both should implement this control independently from one another. All configuration changes to systems should be independently baselined, tested, and approved according to their corporate policies and in line with industry standards.\n \n Implementation Guidelines.\n Applicable to all service models:\n Risk management plays a critical role in ensuring that changes to cloud assets are implemented in a secure and controlled manner. CSPs should leverage risk management practices to identify, assess, and mitigate potential risks associated with changes, minimizing the potential for errors, security breaches, or disruptions to cloud services.\n \n Implementation best practices for this control include (but are not limited to):\n a. Change Management Process: The process should include a change request form, review and approval process, testing, implementation changes procedures and outcomes documentation. Should be ensured that changes status is continuously tracked and that are made in a controlled and consistent manner, minimizing the risk of errors and disruptions. Change request forms should include:\n i. Description of the change\n ii. Justification for the change\n iii. Potential risks of the change\n iv. Impact of the change on business operation\n v. Steps to revert the change in case issues arise\n vi. Approval signatures from relevant stakeholders\n b. Change Risk Management: The impact and type of change should be assessed to determine the risk of the change before it is applies\n i. Before implementing a change, CSPs should conduct a thorough impact assessment to identify potential consequences on cloud assets, performance, security, and compliance requirements\n ii. Changes are categorized based on their impact, urgency, and risk profile. High-risk changes receive prioritized attention and undergo rigorous review and testing\n iii. Evolving risks associated with cloud assets and change management practices should be regularly identified and risk management strategies reviewed and updated accordingly\n c. Change Management Tools: \n i. A change management workflow should be defined to ensure that changes are submitted, reviewed, and approved by relevant stakeholders, including security, operations, and development teams to prevent unauthorized or poorly managed changes\n ii. Change management tools should be adopted to effectively record the change management workflow process\n d. Stakeholders Collaboration: \n i. Collaborate with relevant internal and external interested parties involved in the change and risk management processes\n ii. An appropriate level of subject matter expertise and the roles of reviewers and approvers of changes should be derived by a combination of change type and risk level\n e. Continuous Monitoring and Logging Tools: Should be implemented to provide real-time reporting/monitoring capabilities of the change progress so that timely informed decisions can be made to assist with managing emerging risks resulting from the change\n f. Configuration Management Tools: These tools track and manage cloud infrastructure configurations, ensuring consistency and adherence to change management policies and procedures\n g. Change Review Committee: Security, Privacy, Risk and Compliance personnel should be made part of change review committees",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Unauthorized Change Protection",
        "Control ID": "CCC-04",
        "Control Specification": "Restrict the unauthorized addition, removal, update, and management\n of organization assets.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This control's implementation responsibility is shared for both CSP and CSC, however, both should implement this control independently from one another. All configuration changes to systems should be independently baselined, tested, and approved according to their corporate policies and in line with industry standards.\n \n Implementation Guidelines.\n Applicable to all service models:\n The CSP should establish procedures and implement technical measures to prevent and/or detect any unwanted/unauthorized changes (e.g., additions, removals, and updates) to organizational assets in production, including applications, systems, infrastructure, configurations.\n \n Organizations should permit only qualified and authorized individuals to access systems for purposes of initiating changes. Access restrictions include physical and logical access controls such as cryptographic controls or MFA.\n \n Implementation best practices for this control include (but not limited to):\n a. Centralized Asset Management System: An accurate and up-to-date inventory of all organization assets should be leveraged and used as a single source for tracking the addition, removal, updates of assets (refer to DCS-06) \n b. Change Identity and Access Management: A robust IAM system should be implemented to control user access and changes to assets based on their identities, roles, and entitlements. Strong authentication mechanisms should be used, such as multi-factor authentication (MFA), to prevent unauthorized changes to assets\n c. Change by Least Privilege Principle: The principle of least privilege should be implemented to minimize the risk of unauthorized or accidental changes by restricting access to sensitive assets and configurations\n d. Change by SoD: Ensure sufficient separation of duties exists, such that that same team cannot both develop and authorize changes\n e. Change Monitoring and Logging: \n i. Cloud assets configurations, access logs, and user activities should be continuously monitored to detect unauthorized changes or anomalous behavior\n ii. Unauthorized or unintended changes that could compromise security or disrupt cloud services should be detected, investigated and reported on\n iii. Automated monitoring tools should be used to identify potential security threats and prevent unauthorized changes\n f. Segregate Environments: Segregation of production systems from development and testing environments should be leveraged to minimize the risk of unauthorized changes or security vulnerabilities affecting production systems",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Change Agreements",
        "Control ID": "CCC-05",
        "Control Specification": "Include provisions limiting changes directly impacting CSCs owned\n environments/tenants to explicitly authorized requests within service level\n agreements between CSPs and CSCs.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This control's implementation responsibility is shared for both CSP and CSC, however, both should implement this control independently from one another. All configuration changes to systems utilized should be managed appropriately within the agreement between the CSP and CSC. For the CSP to implement this control and include its provisions in SLAs (i.e., limiting changes impacting the CSCs’ systems), there is a role for the CSC to play, namely to discuss, refine, and approve such provisions.\n \n Implementation Guidelines.\n Processes and procedures established by both the CSP and CSC should reflect change management responsibilities. Each party should acknowledge the other’s responsibility, which should be part of a written change management agreement. The acknowledgment should include a reference to limitations related to changes impacting CSC-owned environments. The CSC should be able to configure, control or communicate exclusion windows to the CSP when changes cannot occur.\n \n IaaS Provider:\n The CSP is responsible for establishing their change management and testing processes, only for the compute, storage, and networking resources offered as part of the IaaS service. No changes should be undertaken to these systems without prior notice to the CSC as the dependent applications could be negatively affected by any CSP-managed asset being changed.\n The CSP Forward Schedule of Changes (FSC) program should be agreed with the CSC as part of a service level agreement.\n \n PaaS Provider:\n The CSP has responsibility for the design, implementation, and management of all supporting infrastructure—virtual elastic compute, server operating systems, storage, and networking—but also middleware, development tools, business intelligence services and database management systems, so any change should be agreed in advance by the CSC prior to implementation.\n \n SaaS Provider:\n The CSP has responsibility for the design, implementation, and asset management of:\n • all supporting infrastructure—virtual elastic compute, server operating systems, storage, and networking\n • middleware, development tools, business intelligence services and database management systems\n • applications configured as contractually with the CSC \n \n Applicable to all service models:\n Additional recommendations that apply for the CSP include (but not limited to):\n a. SLA Authorized Changes and Definition: \n i. The change management process should be integrated with SLAs to ensure that both CSCs and CSPs are accountable for adhering to this process\n ii. What constitutes an authorized change should be defined in the SLA such as specifying the types of changes, the scope of changes, and the approval process for each type of change\n b. Change Management Notification and Approval: CSPs should notify the CSCs of and have the opportunity to review and approve any configuration changes that may impact their cloud environment\n i. A formal change management process should be established with clear notification procedures for CSCs (e.g., a change request (CR) process that includes detailed information about the proposed change, its purpose, impact, potential risks, and rollback procedures)\n ii. Provide CSCs with detailed information about proposed changes, including the potential impact on their environment\n iii. Provide CSCs with timely notifications about proposed changes, including the CR, the expected impact, and the timeline for implementation\n iv. Obtain CSC approval for proposed changes impacting the CSC environment before implementation\n v. Schedule changes that directly impact CSC-owned environments/tenants during agreed-upon maintenance windows (whenever possible)\n c. Change Rollback and Remediation: Remediation procedures should be established within SLAs in case of unauthorized or disruptive changes, including rollback strategies and compensation mechanisms\n d. Post-change reports: Provide CSCs with post-change reports summarizing the implementation of the change, any issues encountered, and the final state of the environment\n e. Continuous Monitoring and Evaluation: CSPs should continuously monitor and improve their change management processes to minimize disruption to CSCs' environments\n i. Include change management performance metrics in SLAs to measure the effectiveness of the process in preventing unauthorized or disruptive changes\n ii. Solicit feedback from CSCs on their change management processes\n iii. Review and update the SLA provisions related to change management regularly to reflect changes in cloud infrastructure, applications, and CSCs’ requirements\n \n NOTE: In an emergency, the CSP may need to apply changes that impact the CSC-owned environments without the explicit authorization of the CSC, in case those emergency changes would be required for the overall security of the CSP’s system. If those types of changes are applied, the CSC should be consulted as soon as possible (Refer to exception change management procedures in CCC-08).",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n Processes and procedures established by both the CSP and CSC should reflect respective change management responsibilities. There should be acknowledgement of each party's responsibility, and it should be part of a written change management agreement between CSC and CSP. The acknowledgment should include a reference to limitations related to changes impacting CSC-owned environments/CSCs. The CSC should be able to configure, control or communicate exclusion windows to the CSP when changes cannot occur.\n \n IaaS Customer:\n The CSC maintains responsibility for all aspects of application service provision except the supporting infrastructure and networking, so any change to these assets managed by the CSP should be authorized in advance by the CSC. The inclusion of change management processes requiring authorisation from the CSC for such changes will lessen the likelihood of a change causing a service degradation.\n \n PaaS Customer:\n The CSC maintains responsibility for all aspects of application service provision except the supporting infrastructure and networking, so any change to these assets managed by the CSP should be authorized in advance by the CSC. The inclusion of change management processes requiring authorization from the CSC for such changes will lessen the likelihood of a change causing CSC service degradation.\n \n SaaS Customer:\n This model expects the CSP to provide a complete software solution that the CSC purchases on a pay-as-you-go basis. The CSC is expected to request changes, or at least be consulted regarding a configuration change as agreed in the service agreement with the CSP.\n \n Additional recommendations that apply for the CSC include (but not limited to):\n a. Change Management Notification and Approval: The CSCs should review and approve any configuration changes that may impact their cloud environment\n i. Collaborate with the CSP to develop and implement effective communication protocols\n ii. Actively review and provide feedback on proposed changes\n iii. Communicate any concerns or potential impacts to the CSP\n iv. Provide timely approval or rejection of proposed changes\n b. Change Rollback and Remediation: The CSC should monitor change implementation and communicate any issues to the CSP\n i. Provide support to the CSP during rollback or remediation efforts\n ii. Test and verify the effectiveness of rollback and remediation procedures\n c. Continuous Monitoring and Improvement: The CSC should provide feedback to the CSP on their change management processes.\n i. Collaborate with the CSP to identify areas for improvement\n ii. Participate with the CSP in the implementation of continuous improvement initiatives\n \n Applicable to all service models:\n Best practices for the implementation of this control as provided for the CSP apply."
    },
    {
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Change Management Baseline",
        "Control ID": "CCC-06",
        "Control Specification": "Establish change management baselines for all relevant authorized\n changes on organization assets.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This control's implementation responsibility is shared for both CSP and CSC, however, both should implement this control independently from one another. All configuration changes to systems should be independently baselined, tested, and approved according to their corporate policies and in line with industry standards.\n \n Implementation Guidelines.\n Applicable to all service models:\n A change management baseline is a snapshot of the current state of all cloud assets at a specific point in time. This baseline serves as a reference point against which all subsequent changes to cloud assets are evaluated and measured. \n \n The purpose of establishing a change management baseline is to ensure that changes are controlled, authorized, and implemented in a consistent and orderly manner to minimize the risk of unintended consequences and maintain the security and integrity of the cloud environment.\n \n The CSP should develop, document, and maintain under version control current baseline configurations and should review and update the baseline configurations when required due to updates or newly installed components.\n \n Implementation best practices for this control include (but are not limited to):\n a. Change Management Baseline: A change management baseline should be implemented that includes a standard and approved state of the organization’s cloud assets that serves as a reference point for the changes. The baseline should include:\n i. A list of all cloud assets (e.g., CMDB), including hardware, software components, their relevant data, their attributes and relationships, enabling effective change management\n ii. The configuration/security settings, version numbers, patch status that are subject to change management should be captured for each cloud asset (e.g., virtualization, network settings, security settings, and VMs, applications/APIs configuration)\n iii. Key performance indicators (KPIs) that measure the health, performance, and utilization of cloud assets\n iv. The current security posture of the cloud environment, including vulnerability assessments, risk assessments, and compliance audits\n b. Documentation: An accurate documentation for each cloud asset baseline should be maintained, including its creation date, author, and associated assets\n c. Changes Tracking and Implementation: \n i. All changes made to cloud assets should be monitored and tracked against the baseline and be well documented (e.g., who made the change, when it was made, what was changed, and any issues or incidents that arise reported on)\n ii. Version control systems (e.g., Git) should be utilized to track baseline changes and maintain historical records\n iii. Proposed changes should be evaluated against the baseline and associated policies before approval\n iv. The baseline should be updated and documented whenever a new change is implemented, and be stored and backed up in a secure and accessible location\n v. Deployed changes should be post-verified that match the approved version and adhere to the established baseline",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Detection of Baseline Deviation",
        "Control ID": "CCC-07",
        "Control Specification": "Implement detection measures with proactive notification in case\n of changes deviating from the established baseline.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This control's implementation responsibility is shared for both CSP and CSC, however, both should implement this control independently from one another. All configuration changes to systems should be independently baselined, tested, and approved according to their corporate policies and in line with industry standards.\n \n Implementation Guidelines.\n Applicable to all service models:\n By proactively detecting and addressing anomalous changes, CSPs can minimize the risk of security breaches, data loss, and compliance violations. When an issue is detected, automated alerts should strongly be considered to notify stakeholders for further investigation. When a deviation is detected, the organization should follow the incident management process (refer to SEF-01). \n \n Implementation best practices for this control include (but are not limited to):\n a. Change Management Baseline Deviations: Changes deviation should be evaluated against the configuration baseline that serves as a reference point for identifying such deviations (refer to CCC-06)\n b. Anomaly Detection Thresholds: Thresholds for determining which changes deviate from the established baseline should be defined and based on historical data, risk assessments, and industry best practices\n c. Change Monitoring Tools: Automated and manual tools and techniques such as configuration scanners, change detectors, and configuration audits, should be utilized to collect and analyze the configuration data and identify any differences or discrepancies to the baseline\n d. Real-time Alerting Mechanisms: Real-time alerting mechanisms should be configured to notify security teams and relevant stakeholders when anomalies are detected. These alerts should provide detailed information about the anomaly, its potential impact, and recommended actions\n e. Risk-based Alerts Prioritization: Alerts should be prioritized based on the potential severity and impact of the detected anomaly to enable security teams focus their attention on the most critical issues and respond promptly\n f. Anomalies Assessment Automation: Initial investigation steps for detected anomalies should be employed whenever possible to reduce the time required to identify the root cause of anomalies. This could involve automated correlation of events, data analysis, and threat intelligence lookup\n g. Escalation Process: An escalation process should be defined for handling anomalies that require further investigation or remediation. This process should specify who is responsible for each step, the timeline for response, and the communication protocols\n h. Anomalies and Remediation Actions Documentation: All detected anomalies, the investigation process, and the actions taken to remediate the issue should be documented (i.e., to understand the root cause of anomalies, prevent recurrences, and demonstrate compliance with security regulations)\n i. Detection Rules and Thresholds Review: Detection rules and thresholds should be regularly reviewed and refined based on new threat intelligence, emerging vulnerabilities, and changes in cloud infrastructure or applications\n j. Stakeholders Notification: Relevant stakeholders, such as the change management team, the CSP and CSC should be notified and alerted of any deviations or anomalies, and provided with the necessary information and evidence for further investigation and resolution",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply.\n In addition, the CSC is expected to baseline assets connecting to the contracted cloud services, and obtain an understanding of CSP baselines. When a deviation is detected, the CSC should follow the incident management policies and procedures defined in SEF-01 including notifying the CSP as soon as possible."
    },
    {
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Exception Management",
        "Control ID": "CCC-08",
        "Control Specification": "Implement a procedure for the management of exceptions, including\n emergencies, in the change and configuration process. Align the procedure with\n the requirements of GRC-04: Policy Exception Process.'",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This control's implementation responsibility is shared for both CSP and CSC, however, both should implement this control independently from one another. All configuration changes to systems should be independently baselined, tested, and approved according to their corporate policies and in line with industry standards.\n \n Implementation Guidelines.\n Applicable to all service models:\n CSPs should implement a robust procedure for managing exceptions, including emergencies, in the change and configuration process to ensure the availability, security, and reliability of their cloud services. Effective exception management ensures that changes are implemented in a controlled manner, even in the face of unexpected events or urgent situations.\n \n Implementation best practices for this control include (but are not limited to):\n a. Exception Categories: Different categories of exceptions should be defined, including routine exceptions, urgent exceptions, and emergencies in order to prioritize responses based on the severity and urgency of the situation\n b. Categories Approval Process: Approval processes for each exception category should be defined by specifying who has the authority to approve exceptions and the required documentation. Ensure that emergency exceptions have a streamlined approval process to minimize delays\n c. Exception Requests Documentation: Documentation of all exception requests should be mandated, including the nature of the exception, justification for the exception, potential risks, and mitigation measures to provide transparency and accountability for exception management\n d. Exceptions Communication: Exceptions should be communicated to relevant stakeholders promptly, including the change management team, security team, and affected CSCs\n e. Exceptions Rollback Procedures: Rollback procedures should be established for all exceptions, especially those involving critical systems or data\n f. Post-Exception Reviews: Thorough post-exception reviews should be conducted to analyze the root cause of the exception, identify lessons learned, and implement preventive measures to minimize the likelihood of similar incidents in the future\n g. Exception management and Incident Response Integration: Exception management should be integrated with the incident response process to ensure a coordinated response to security incidents or other disruptions that require immediate action\n h. Exception Management Reviews: Exception management procedures should be regularly reviewed and refined based on feedback from post-exception reviews, changes in cloud infrastructure or applications, and evolving security threats\n i. Exception Records Documentation and Maintenance: A centralized repository of exception records should be maintained for the collection and preservation of evidence and chain of custody documentation for incident management analysis purposes, including the nature of the exception, approval details, rollback procedures, and post-exception review findings",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Change Control and Configuration Management",
        "Control Title": "Change Restoration",
        "Control ID": "CCC-09",
        "Control Specification": "Define and implement a process to proactively roll back changes to\n a previous known good state in case of errors or security concerns.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This control's implementation responsibility is shared for both CSP and CSC, however, both should implement this control independently from one another. All configuration changes to systems should be independently baselined, tested, and approved according to their corporate policies and in line with industry standards.\n \n Implementation Guidelines.\n Applicable to all service models:\n Implementing a robust process for proactively rolling back changes to a previously known good state in case of errors or security concerns is essential for CSPs to maintain the stability, security, and reliability of their cloud services. \n A well-defined rollback process ensures that changes can be reversed quickly and effectively, minimizing the potential impact of errors or security incidents. The CSC should be notified if deployment of changes fail and if the roll back occurred.\n \n Implementation best practices for this control include (but are not limited to):\n a. Rollback Baseline: \n i. A rollback baseline that includes snapshots, backups and restore points of all critical cloud assets at a known stable state should serve as a reference point for recovery and restoring the environment\n ii. Detailed change logs and backups of configurations should be maintained to facilitate rollback procedures\n b. Rollback Process: \n i. Rollback process and supporting procedures should be established that can be implemented quickly and effectively in case of issues\n ii. Rollback procedures should include identifying rollback points, triggering rollbacks, and verifying the success of rollbacks\n iii. Rollback procedures should be automated whenever possible to minimize the time and effort required to revert changes (automated tools can be used to restore configurations, data, and applications from the rollback baseline)\n c. Rollback Triggers: The triggers for initiating a rollback should be defined, including specific error codes, security alerts, or performance degradation beyond acceptable thresholds and should be configurable to align with the CSP's risk tolerance and security policies\n d. Rollback Testing Strategy: Rollback procedures should be regularly tested to ensure they are effective and functioning as intended. Use staging environments or isolated test environments to conduct rollback simulations without impacting production systems\n e. Rollback Procedures Documentation: Rollback procedures should be documented, including the steps involved, the tools used, and the expected outcomes\n f. Rollback and Change Management Integration: Rollback procedures should be integrated with the change management process to ensure that rollback plans are considered during change implementation and that rollback triggers are aligned with change approval processes\n g. Rollback History: A history of rollback events should be maintained, including the date, time, reason for rollback, and the specific changes reverted. This historical data provides valuable insights for identifying patterns, improving rollback procedures, and demonstrating compliance with security regulations\n h. Rollback Procedures Reviews: Rollback procedures should be regularly reviewed and refined based on testing results, feedback from rollback events, and evolving security threats or cloud infrastructure changes\n i. Rollback Simulation Exercises: \n i. Periodic rollback simulation exercises should be conducted to test the effectiveness of rollback procedures and identify areas for improvement\n ii. Have a dedicated team responsible for handling change rollbacks and remediation efforts",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    }
]