[
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Security and Privacy Policy and Procedures",
        "Control ID": "DSP-01",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain\n policies and procedures for the classification, protection and handling of data\n throughout its lifecycle, and according to all applicable laws and regulations,\n standards, and risk level. Review and update the policies and procedures at\n least annually.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n The implementation responsibility for this control is shared and independent for the CSP and CSC, since both CSP and CSC need to independently establish policies and procedures for data lifecycle management as part of their organization's overarching data governance framework.\n \n Implementation Guidelines.\n Applicable to all service models:\n The CSP should include in its policies and procedures a comprehensive framework for the classification, privacy, protection, and handling of data throughout its lifecycle. This includes clearly defined data storage criteria and secure data disposal practices. The policy should emphasize compliance with relevant regulations, periodic security audits, and continuous monitoring to ensure the security of customer data.\n \n Policies should include (but not limited to) provisions on the following:\n a. Scope and Objectives: \n i. The scope and objectives of the policy and what it should achieve\n ii. Formal approval by Executive Management, Leadership Committee (EXCO) and/or Board level members\n iii. All the phases of the data/information lifecycle including but not limited to Collection, Creation, Transmission, Storage, Usage, Sharing/Disclosure, Retention/Archival and Destruction \n iv. The relevant entities and jurisdictions and/or geographical regions that the organization operates in\n v. The relevant regulations or applicable industry standards that are applicable to the entity \n vi. Stakeholders who will be either the owners or custodians/stewards of data (e.g. stakeholders include customers, business partners, third parties, employees)\n vii. Requirements for communicating the policy to all relevant stakeholders. Communication of policies and procedures can be handled via methods such as electronic digital mailers (EDMs) sent to all staff or via e-learning platforms\n viii. Alignment to company code, objectives and values (i.e., trust management)\n b. Data Classification: Data classification policies and procedures should include the following: \n i. Data classification and labeling of data with clear definitions and examples (e.g., Public, Internal, Restricted, Confidential)\n ii. Asset valuation of the asset that could potentially store or process the data (e.g., Asset Valuation Ratings such as High, Medium, and Low mapped against Confidentiality, Integrity; availability and impacts such as Financial, Reputational, Customer Service, Operational, and Regulatory. The ratings should be decided based on the label applicable to the data/dataset and the overall risk it represents) (refer to DCS-05)\n iii. Acceptable Use Agreements (AUAs) should be communicated and signed by all relevant stakeholders, especially before employee/personal onboarding. The AUA should be a declaration that confirms awareness and willingness to protect data\n iv. Technologies that either label data/information automatically at various layers of the infrastructure (e.g., email gateway, end Point) or allow an end user to specifically choose classification should be considered for implementation\n v. Data and asset classification should occur before a technology asset or service is being designed and is eventually placed into production. An asset value rating should be assigned to every asset in the inventory\n vi. All data and its associated assets should be accounted for (i.e., a Data and asset inventory should exist)\n vii. A Responsible, Accountable, Consulted, and Informed (RACI) matrix that specifies the task of each role or individual that will act as either data owner, steward/custodian or processor\n viii. Data flow diagrams should be available to understand how specific data elements flow through the ecosystem and where they are stored and/or processed\n \n Note: From a control implementation perspective, the CSP should offer Cloud Access Security Broker (CASB) solutions that are able to classify and label data based on known regulations (e.g., HIPAA, PCI-DSS) or custom rules (e.g., financial or proprietary data), and DLP.\n \n c. Data Privacy: Data Privacy policies and procedures should include the following: \n i. Data minimization, specifically during the collection of data for the purposes of ensuring alignment to privacy regulations\n ii. Privacy notices covering what data will be collected, how it will be used, who will have access to the data, with whom it will be shared or disclosed (including third parties), how long it will be retained, and how it will be protected. From an implementation perspective, privacy notices can take the form of pop-ups, banners, layered notices, or similar\n iii. Additional concepts such as Consent, Choice, Collection Limitations, Data Quality, Reliable Sources, Primary & Secondary Uses, and Internal and External Disclosure\n iv. Data subject access and under what conditions it will be provided (i.e., how data subjects can access and/or export their data and how they can contact the organization with questions or concerns around privacy)\n d. Data Handling & Protection: Data handling & protection policies and procedures should include the following: \n i. Data protection controls should be commensurate with the classification of data, its associated label, and the overall value of the asset that stores or processes the data (where required approvals are taken), including and not limited to all types of data (e.g., personal data, sensitive data)\n ii. Logical controls including but not limited to encryption of data in storage & in transit, use of Trusted Execution Environments (TEEs) for data in use, authentication, authorization (access control and permissions), audit trails, digital rights management (DRM), data leak prevention (DLP), outbound proxy, SSL/TLS bypass, database access management (DAM), anonymization, tokenization, and pseudonymization.\n \n Note: types of encryption, algorithms, key sizes, and key management should be referenced in the Cryptography, Encryption & Key Management domain of the CCM.\n \n iii. Physical controls including but not limited to the physical access controls such as locks and keys, biometrics, smart cards, and mandatory dual control for opening fireproof safes\n iv. Environmental controls including but not limited to protection against extreme temperatures, humidity, fire, and other acts of nature\n v. Additional controls including but not limited to protection against acts of war (e.g., terrorism, biological or chemical warfare)\n vi. Data handling controls for all types of data, hard copies and/or digital\n vii. Protection of data on different types of devices including but not limited to end points, servers, mobile devices, removable (e.g., USB drives, SD cards) and backup media (e.g., encryption of backup tapes) \n viii. Business Continuity and disaster recovery measures that will ensure confidentiality, integrity and availability of data (e.g., the use of special air-gapped vaults to recover from ransomware attacks, tapes off site, recovery from hot, warm, or cold sites, and regular recovery testing)\n ix. Approach to external security testing, vulnerability assessment and certifications\n x. Approach to risk management and shared responsibilities\n xi. Approach to manage security incidents and data breach notifications.\n e. Data Storage & Retention: Data Storage & Retention policies and procedures should include the following: \n i. The length/period of time the data will be retained as per laws, regulations and business requirements\n ii. Type of data including but not limited to customer data, backups, audit logs, and any data that can assist with forensic investigations\n iii. Requirements to collect and retain evidence, hardcopy records, monitoring, and recording mechanisms\n iv. Handling chain of custody which includes prevention of manipulation of records\n v. Be aligned with the organization’s topic-specific policy on records management and other records requirements\n vi. Be chosen such that required records can be retrieved in an acceptable time frame and format, depending on the requirements to be fulfilled \n vii. Storage and handling procedures are implemented in accordance with recommendations provided by manufacturers of storage media. Consideration should be given to the possibility of deterioration of media used for storage of records\n viii. Handling of metadata describing the context, content and structure of records, as well as their management over time\n f. Data Destruction: Data Destruction policies and procedures should include the following: \n i. The conditions under which data will be destroyed including but not limited to termination of service by the CSC, automatic deletion after a specific period (e.g., 30 days) where applicable or when requested by the CSC or storage device has reached end of life\n ii. The specific methods that will be used to destroy data (e.g., cryptographic erasure, writing zeros, degaussing, physical destruction or as per media sanitization guidelines)\n g. Approval: Approval requirements and senior management involvement to ensure alignment with the organization's strategic goals and risk appetite\n i. An approval process should be established for any changes or modifications to the policy and procedures\n ii. A documented record of approvals (including dates, names of approvers, and any relevant comments or discussions) should be maintained\n h. Communication: Effective communication of the policy and procedures should be facilitated to all relevant cloud stakeholders\n i. Maintenance and Reviews: Policies and procedures for the classification, protection and handling of data should be documented, reviewed and updated at least annually to ensure alignment with evolving cloud security landscape and to reflect changes in cloud technology, regulations, and risks",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n Applicable to all service models:\n The CSC's policies and procedures should encompass guidelines for the proper classification of sensitive data (refer to DSP-04), specifying levels of access and security protection requirements. Additionally, the policy should define procedures for secure data handling, periodic reviews, and collaboration with the CSP to ensure adherence to mutually agreed security objectives throughout the data lifecycle.\n \n Policies should include (but not limited to) provisions on the following:\n The policies provided for the CSP apply."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Secure Disposal",
        "Control ID": "DSP-02",
        "Control Specification": "Apply industry accepted methods for the secure disposal of data from\n storage media such that data is not recoverable by any forensic means.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n The implementation responsibility for DSP-02 is Shared and both CSP and CSC need to implement it. This is due to the fact that either CSP or CSC may, depending on their unique requirements (e.g., regulation, end of life of storage media) may be required to securely dispose of data from storage media. \n \n This control is also Dependent since the CSP is expected to have the technological capability that supports industry accepted methods of deleting data in a way that is not retrievable when requested by the CSC, or when a storage device is at the end of its lifetime and needs to be decommissioned. \n \n Implementation Guidelines.\n Applicable to all service models:\n a. Data Disposal Authorization: Establish authorization procedures for data disposal requests. Only authorized personnel should be able to initiate and approve such requests\n b. Restrict Access after Disposal Request: the CSP should disallow any new attempts to access data once the request for data deletion has been submitted and approved\n c. Data Disposal Options: Explore various data disposal options and select the most appropriate method based on data sensitivity, media type and regulatory requirements\n d. Off-Premise Transport Restriction: Data media storage should not be permitted to leave the organization’s premises nor be transported out of the CSP's datacenters without being sanitized or destroyed\n e. Data Destruction: Prior to physical media disposal, all data stored on such media must be completely destroyed using industry-approved methods. Implement secure data erasure procedures to render data irretrievable from storage devices. This may include physical destruction of media (e.g., hard drives demagnetization, paper shredding, etc.), data cryptographic erasure, or software-based erasure methods\n f. Cryptographic Erasure: \n i. utilize encryption to render data irretrievable, by encrypting the data and then destroying the encryption key.\n ii. the CSP should make sure that key material (including but not limited to keys, seeds, initialization vectors) is deleted in a forensically sound manner\n g. Data Sanitization: as part of the decommissioning process or based on requests by the CSC for data deletion, a secure logical or physical data deletion method on media should be used (including but not limited to zeroization, cross-cut shredding, degaussing, incineration, or pulverizing) based on industry accepted practices such as those specified in NIST SP 800-88 Guidelines for Media Sanitization, or methods such as DOD 5220.22-M\n h. Verification of Data Destruction: Require a systematic process for verifying the successful and complete destruction of data on decommissioned media through a documented and auditable verification mechanism\n i. Certification of Equipment Disposal Vendors: Use certified data disposal vendors who adhere to recognized industry standards and provide documentation certifying the proper disposal of data\n j. Disposal Record-Keeping and Auditing: Maintain detailed records of all data disposal events into a tracking system with a digital certificate of media disposition that clearly indicates whether they have been cleared, purged, or destroyed. Records should include the date, type of data, disposal methods, dates of disposal, authorized personnel involved and verification results for audit and compliance purposes\n k. Disposal of Active and Back Up Data: data should be deleted from both active and backup storage media including but not limited to locations where temporary and obsolete files are stored\n l. Change Management for Data Disposal: all secure data disposal processes should only be carried out using a well-defined change management approval process\n m. Compliance with Data Privacy Regulations: Ensure that data disposal processes comply with all applicable data privacy regulations, such as the General Data Protection Regulation (GDPR) or the California Consumer Privacy Act (CCPA).\n n. Periodic Audits and Reviews: Establish a schedule for periodic audits and reviews of data disposal processes, including both physical media disposal and data destruction, to ensure ongoing compliance and effectiveness.\n \n Note: Active storage systems are production servers, while backup storage systems are full or incremental backups/copies of active storage systems.",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply.\n \n Additional guidelines for the CSC include:\n a. Disposal of Active and Back Up Data: the CSC should ensure that data be deleted from both, active and backup storage media\n b. Cryptographic Erasure: the CSC should implement managed keys to enable crypto shredding, where available and possible\n c. Contractual Agreement with the CSP: \n i. Ensure data disposal requirements are clearly articulated in contractual agreements with the CSP, ensuring they adhere to the organization's data destruction policies.\n ii. the logical and physical destruction of data, commensurates with the classification of data and in line with required laws and regulations\n \n Note: Active storage systems are production servers, while backup storage systems are full or incremental backups/copies of active storage systems."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Inventory",
        "Control ID": "DSP-03",
        "Control Specification": "Create and maintain a data inventory, at least for any sensitive\n data and personal data.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This control ownership and implementation responsibility is defined as “Shared (Dependent)” because both parties are responsible for performing and maintaining a data inventory. The CSP needs to maintain an inventory for the CSC’s customer data (where applicable and possible) and cloud derived data, while the CSC needs to maintain an inventory, at least, for sensitive and/or personal data.\n \n The control is Dependent since the CSC will depend on the technical capabilities available of the CSP to perform a critical data inventory activity, known as data discovery. Also, the CSP may require access to the CSC’s sensitive or personal data in the event of responding to a legal request, including for e-discovery.\n \n Implementation Guidelines.\n Applicable to all service models:\n A comprehensive inventory of data fields (henceforth known as data inventory) should be created and maintained, at least for the data that is labeled \"sensitive\" or \"personal data\" (e.g., biometric data) throughout the entire lifecycle of data. It should also include data required to respond to compliance requests.\n The data inventory should:\n a. explicitly identify the CSC data and CSP-derived data\n b. provide visibility into the location (e.g., identification of the cloud service), volume, and context of sensitive and personal data. This can be done using methods such as data discovery or regular audits\n c. cover data types including but not limited to structured (e.g., stored in databases) and unstructured (e.g. stored in files, emails) data and metadata\n d. be used to identify which data is difficult to identify, export, or delete\n e. detail how sensitive and personal data is used, who has access to it, who it is shared with, the geographical location it is stored, and how long it will be retained\n f. track data movement as it travels within, across, or outside the organization (e.g., at third parties, business partners, vendors)\n g. state how data is being protected and who is responsible for data protection within the organization\n h. include a data inventory matrix as an initial master list, and an automated batch process should run daily or under certain conditions, including but not limited to system architecture changes, changes in the classification of the data, changes in the risk posture based on storage, transmission or processing of such data, or changes in laws and regulations, to update the data inventory on a regular basis",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Classification",
        "Control ID": "DSP-04",
        "Control Specification": "Classify data according to its type and sensitivity level.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n The control ownership rationale for IaaS is “Shared (Independent)” since:\n • The CSC has more control on IaaS, they can install any tool they wish to perform data classification and hence it is their sole responsibility for data managed on the infrastructure\n • The CSP is required to classify data (e.g., cloud derived data) generated by the IaaS infrastructure. \n \n The control ownership for IaaS is “Independent” because the CSP and CSC can classify independently depending on the data type (e.g., The CSP may want to classify log data / cloud derived data from IaaS services, while the CSC may want to classify sensitive or personal data which it stores on IaaS infrastructure).\n \n The control ownership for PaaS and SaaS is Shared “Dependent” because:\n • The CSC has less control over the underlying infrastructure and has to depend on the CSP in order to provide tools that will classify data\n • The CSP is dependent on the CSC because it needs to classify cloud-derived data based on the interaction of the CSC with cloud services\n \n Implementation Guidelines.\n Applicable to all service models:\n a. data classification and labeling of data with clear definitions and examples (e.g., Public, Internal, Restricted, Confidential) should exist. Labels should contain attributes for both security and privacy. Labeling standards such as Carnegie Mellon University: Guidelines for Data Classification and SANS Institute: Tagging Data to Prevent Data Leakage (Forming Content Repositories) should be considered\n b. Asset valuation could potentially store or process data (e.g.,asset valuation ratings such as High, Medium, and Low mapped against Confidentiality, Integrity, Availability, and Impacts such as financial, reputational, customer service, operational and regulatory) should exist. The ratings should be decided based on the label applicable to the dataset and the overall risk it represents\n c. technologies that either label data automatically at various layers of the infrastructure (e.g., email gateway, endpoint) or allow an end user to specifically choose classification should be considered for implementation\n \n Note on Item c: From a control implementation perspective, the CSP should offer Cloud Access Security Broker (CASB) solutions that are able to classify and label data based on known regulations (e.g., HIPAA or PCI-DSS) or custom rules (e.g., financial or proprietary data) and perform Data Leak Prevention (DLP).\n \n d. data and asset classification should occur before a technology asset or service is being designed and placed into production. An asset value rating should be assigned to every asset in the inventory; cloud-derived data is an exception to this recommendation\n e. a RACI matrix that specifies the task of each role or individual that will act as either data owner, steward/custodian or processor should exist\n f. data protection controls should be commensurate with the classification of data, its associated label, the overall value of the asset that stores or processes the data and should include but not be limited to the following: \n i. Logical Controls including but not limited to encryption of data in transit, authentication, authorization (access control and permissions), audit trails, digital rights management (DRM), DLP, outbound proxy, SSL/TLS bypass, database access management (DAM), anonymization, tokenization, and pseudonymization. Types of encryption, algorithms, key sizes, and key management should be referenced in the Cryptography, Encryption & Key Management (CEK) control domain\n ii. physical controls including but not limited to the physical access controls such as locks & keys, biometrics, smart cards and mandatory dual control for opening fireproof safes & cameras\n iii. environmental controls including but not limited protection against extreme temperatures, humidity, fire, and other acts of nature\n iv. additional controls including but not limited to protection against acts of war (e.g., terrorism, biological or chemical warfare)\n g. Data Handling should include controls for all types of data, hard copies and/or digital\n h. protection of data on different types of devices including but not limited to end points, servers, mobile devices, removable (e.g., USB drives, SD cards ) & backup media (e.g. encryption of backup tapes)\n i. business continuity and disaster recovery measures that will ensure the confidentiality, integrity, and availability of data (e.g., the use of special air-gapped vaults to recover from ransomware attacks, tape off-siting, recovery from hot, warm, or cold sites, regular recovery testing\n j. data and asset classification review should occur at least annually or based on certain conditions, including but not limited to changes in the classification of the data or changes in laws and regulations",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n Applicable to All Service Models:\n The implementation guidelines provided for the CSP apply. \n \n Additionally, the CSC should consider the data classification and labeling technologies that the CSP provides during Request For Proposal (RFP)."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Flow Documentation",
        "Control ID": "DSP-05",
        "Control Specification": "Create data flow documentation to identify what data is processed,\n stored or transmitted where. Review data flow documentation at defined intervals,\n at least annually, and after any change.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n The control ownership is defined as “Shared (Independent).” Shared, because both the CSP and CSC require knowing what data is processed, stored and transmitted, and where. Independent, because the documentation can be created without dependency of the CSP on the CSC and vice-versa.\n \n Implementation Guidelines.\n Applicable to all service models:\n Data Flow Diagram (DFD) documentation should consist of a visual representation of the following:\n a. At a minimum, it should highlight where sensitive data (e.g. data labeled as personal data, Top Secret, Secret, Restricted or Internal) is processed, stored and transmitted. \n b. Sources* (typically where a connection originates from) , destinations* (typically where a connection terminates), subjects **(users, systems/assets, or processes), and objects (systems/assets, or processes). Since subjects or objects could include technology components (aka systems or assets) where the data will either be stored, processed or transmitted, a recommended way of depicting them effectively is to maintain the balance of the detail of components shown, such that it is easily understood by most audiences, technical or non-technical (e.g., by naming the technologies in use)\n c. arrows which indicate whether the communication is one way or two way\n d. how data moves between sources, destinations, subjects and objects. One recommended method of depicting this is by using numbers that indicate the sequential flow of information (e.g., 1 to 2, 2 to 3, 3 to 4) and combining that with arrows indicating which specific way the data is actually flowing. It is also recommended to implement application stack maps to understand where data will reside in order to factor in geographic differences in monitoring and data capture\n e. where required and necessary, additional information*** such as type of operations on the data (e.g., read vs. read/write), protocols used to transmit data (e.g. HTTP, SMTP, REST), port numbers (e.g.. 443, 80), and boundaries highlighting the isolation between internal and external networks (e.g., public internet vs backend database) should be included\n f. use of wireframes to structure a journey is also a popular method used to explain data flows\n g. various stages of the data lifecycle from creation, use, sharing, archival to destruction\n h. DFD documentation should be reviewed and updated at least once annually or when key changes take place on where the data is stored, processed or transmitted, or if the classification of the data changes (e.g., an asset that was earlier not storing sensitive personal data, will now begin storing such data)\n i. DFD should documentation be ready and completed at the system design stage of the SDLC. This approach has a higher probability of the high level design (HLD) being more comprehensive, completed, and implementable\n j. where possible, the CSP and CSC should work with the systems engineering team to design a systems logical design (SLD) showing all system component servers (e.g., web, application, Windows, database, network, SAN, Internet ) and the data flows, then review with all parties involved for final design and implementation\n \n * Examples include (but are not limited to):\n • systems exposed to the entire world (i.e., exposed to 0.0.0.0) \n • systems exposed to a limited audience / number of systems (e.g., exposed to a group of beta customer devices only)\n • systems exposed to business partners \n • systems exposed to 3rd parties\n \n ** Examples include (but are not limited to):\n • customers\n • business partners\n • vendors\n • 3rd parties\n • the general public \n \n *** Typically, DFDs do not detail lower level network components like routers or switches. That said, it is possible that other components such as firewalls, Intrusion Prevention Systems (IPS) , File Scanning & Sandboxing systems , content delivery networks (CDN), or more are part of DFDs; these should be included where required and necessary.",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Ownership and Stewardship",
        "Control ID": "DSP-06",
        "Control Specification": "Document ownership and stewardship of all relevant documented personal\n and sensitive data. Perform review at least annually.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n The control ownership is defined as “Shared (Independent).” Shared, because both the CSP and CSC should document their respective data ownership, stewardship, and custodianship responsibilities. Independent, because the CSP and CSC can do this without dependency on each other. \n \n Implementation Guidelines.\n Applicable to all service models:\n A data responsibility matrix can be defined, documented, and communicated. The matrix should include, but not be limited to:\n a. at a minimum, the types of data should include personal data, and data labeled sensitive. Alternative labels could include Confidential, Restricted, Secret, or Top secret or Similar), and the data retention period\n b. names or roles of individuals who will act as either owners or stewards of the data. It is recommended to add a RACI matrix which depicts the clarity with respect to who can do what with the data types\n c. clear definitions of the what the terms data owner, data steward (e.g., enterprise, functional, or other), data custodian, data consumer, data producer, or data protection officer mean and what they are allowed to do with the data\n d. obligation associated with each data element/field. This can include regulatory, contractual or other obligations\n e. frequency at which the documented personal and sensitive data should be reviewed. It should be reviewed at least once annually\n f. a data responsibility matrix should be communicated to all stakeholders within organizations via methods including but not limited to policies, standards, electronic mailers, education workshops, or online security awareness programs",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Protection by Design and Default",
        "Control ID": "DSP-07",
        "Control Specification": "Develop systems, products, and business practices based upon a principle\n of security by design and industry best practices.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n The control ownership is defined as “Shared (Dependent)”. Shared because the CSP and CSC should complete security/privacy by design activities for the products and services that they wish to implement (e.g., the CSP conducts the activity for a product or service it is going to offer, while the CSC does the same in order to offer the product or service to its own set of stakeholders - customers, business partners, employees, third parties, or the general public). \n \n Dependent, because both parties rely on each other for “baking in” security and privacy. The CSP, for instance, depends on the CSC's feedback as input to improving an existing product or service, so it can improve it in a later version. The CSC depends on the CSP because security and privacy by design requires security architects to propose options, with benefits, drawbacks, and costs to senior management. As such, dependency on the CSP becomes vital as the CSC may not have complete knowledge of the array of products available (e.g., either on the CSP marketplace or natively), or how to implement it in a secure manner to suit the CSC's cloud and/or hybrid ecosystem. \n \n Implementation Guidelines.\n Applicable to all service models:\n a. before security- and privacy-design-activities begin, the data and asset inventory, data classification and asset valuation, and DFD documentation and HLD, at a minimum should be completed. This is recommended as a prerequisite to ensure that the security or privacy controls that are designed are commensurate with the value of the data, and the associated asset and can be executed in an efficient manner; decisions on baking in security and privacy controls are based on complete and accurate information available at hand\n b. security-by-design and privacy-by-design activities should begin with examining DFD and the HLD documentation, at a minimum. Where possible and if available, Low Level Design (LLDs) should also be reviewed\n c. As part of the activity, threat modeling should be conducted to envision which specific threat actors (the who, e.g., script kiddies, hacktivists, criminals, nation states) could attack a specific asset, their motives (e.g., money, political, espionage), and what specific threats (the method via which they could attack and what weaknesses they could exploit) pose to an asset's or data's security and/or privacy. Threat modeling can be performed using approaches or frameworks such as STRIDE, DREAD, PASTA, or similar. If agile methodologies such as scrum or Kanban are being used within the organization, threat modeling can be conducted by documenting evil stories or misuse cases for every user story produced during a sprint. It is also recommended to create threat modeling diagrams that visually depict the concept of trust boundaries, isolation, threats affecting each asset, and recommended countermeasures. Threats can be classified into people, process, or technology\n d. post threat modeling, a comprehensive security pattern* detailing the security requirements, should be created. Security requirements should consider threats identified, potential weaknesses, regulatory requirements, and recommend countermeasures that lead to prevention, detection, response or recovery of an asset that will store, process. or transmit data. NIST's Identify, Protect, Detect, Response, and Recovery model is sometimes applied as a recommended baseline\n e. security requirements should be created for all stages of the SDLC, from feasibility study to design to build to run (operationalize) to maintenance\n f. security requirements should be created for every component in the design; this includes but is not limited to all technology assets in scope of the design and network connectivity between those assets\n g. security requirements should cover scenarios that involve people (e.g., user education, customer education), process (e.g., customer registration for a mobile banking app via multiple authentication methods such as face verification and a one-time code sent via email the first time) and Technology (e.g., mutual TLS for all APIs that connect to third parties)\n h. security requirements some of which may also apply to privacy should include but not be limited to Authentication, Authorization, and Accounting (AAA) for DAM. \n \n Note: AAA concepts are also covered via identity and access management security requirements that cover concepts such as MFA, role based or attribute based access control (RBAC/ABAC), conditional access policies, and privileged access management (PAM)\n \n i. application security (e.g., alignment to ASVS for web, mobile application security verification standard MASVS, OWASP Top 10 API, and OWASP Top 10 for CI/CD\n j. infrastructure security (e.g., hardening of technology assets based on industry standard benchmarks)\n i. network security (e.g., security of data in transit, use of mutual TLS, versions of TLS and recommended ciphers)\n ii. encryption of data at rest using concepts such as transparent data encryption (TDE), volume-based encryption or storage-based encryption, format-preserving encryption (FPE), and order-preserving encryption should be considered. \n iii. Logging & Monitoring (refer to LOG domain)\n iv. Incident Response & Forensics (refer to SEF domain)\n v. Business Continuity & Disaster Recovery (refer to BCR domain)\n \n Note: Encryption is also a key privacy by design control. It has not been stated in the privacy by design section on purpose, in order to avoid duplication. The recommendations mentioned here apply to both DSP-07 & DSP - 08\n \n k. Security controls should be baked into every phase of the data lifecycle, from creation to use to sharing to archival to destruction\n \n * Security patterns are documented approaches that define security requirements that can be used in a repeatable manner for the same or similar use cases.",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n Applicable to all service models:\n The implementation guidelines for the CSP apply.\n \n In addition, the below apply exclusively for the CSC:\n a. all required security requirements should be prescribed in checklists that are used for selection of a (RFP and Request for Quote (RFQ))\n b. special attention should be paid for security requirements for scenarios that cover data migration (e.g., from legacy systems to microservice based implementations, or from production to test environments), and file uploads/downloads (e.g,. scanning for malware, sandboxing and/or file size restrictions)\n c. master service agreements (MSA) should contain clauses that cover security requirements which include, but are not limited to, the specific security requirements mandated by the regulator in the specific jurisdiction, general security requirements that will assist with implementation of controls that will reduce technical debt or mitigate cyber security risks in the long term, and those that will apply to the CSP's subcontractors and/or dependent parties (in order to cover supply chain risks)\n d. send a list of CSC-preferred security clauses to the CSP as part of the checklists that are part of the RFP/RFQ that will be executed to select a specific CSP. Sample security clauses include but are not limited to \n i. SLAs with respect to remediation of vulnerabilities or risks rated critical or high\n ii. threat and vulnerability management by the CSP on a regular basis with a specific requirement of frequency (e.g., once annually) to send reports to the CSC\n iii. product security (e.g., product should be free or malware or backdoors)"
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Privacy by Design and Default",
        "Control ID": "DSP-08",
        "Control Specification": "Develop systems, products, and business practices based upon a principle\n of privacy by design and industry best practices. Ensure that systems' privacy\n settings are configured by default, according to all applicable laws and regulations.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n The control ownership is defined as “Shared (Dependent).” Shared, because the CSP and CSC should complete privacy by design and default activities for the products and services that they wish to implement (e.g., the CSP will conduct the activity for a product or service it is going to offer the CSC, while the CSC will do the same in order to offer the product or service to its own set of stakeholders - customers, business partners, employees, third parties or the general public).\n \n Dependent, because both parties rely on each other for baking in privacy (sometimes via security control guidance specific in DSP-07). The CSP, for instance, depends on the CSC’s feedback as input to improve an existing product or service, so it can be improved in a later version. The CSC depends on the CSP because privacy by design and default requires security architects to propose options, with benefits, drawbacks, and costs to senior management stakeholders. As such, dependency on CSPs becomes vital as the CSC may not have complete knowledge of the array of products available (e.g., either on the CSP’s marketplace or natively), or how the implementation can be made in a secure manner to suit the CSC's cloud and/or hybrid ecosystem. \n \n Implementation Guidelines.\n Applicable to all service models: \n a. Before privacy by design and default activities begin, data and asset Inventory (as per control DSP-03), data classification and asset valuation (as per DSP-04), DFD and HLD at a minimum should be completed. This is recommended, as a prerequisite, in order to ensure that the security or privacy controls are commensurate with the value of the data, and the associated asset and can be executed in an efficient manner (i.e., decisions on baking in security and privacy controls are based on complete & accurate information available at hand\n b. privacy by design activities should begin with examining DFDs and the HLD at a minimum. Where possible and if available the LLD should also be reviewed\n c. as part of the activity, threat modeling should be conducted to envision which specific threat actors (the who, e.g., script kiddies, hacktivists, criminals, nation states) could attack a specific asset, their motives (e.g., money, political, espionage), and what specific threats (the method via which they could attack and what weaknesses they could exploit) pose to an asset's or data's security and/or privacy. Threat modeling can be performed using approaches or frameworks such as STRIDE, DREAD, PASTA, or similar. If agile methodologies such as scrum or Kanban are being used within the organization, threat modeling can be conducted by documenting evil stories or misuse cases for every user story produced during a sprint. It is also recommended to create threat modeling diagrams that visually depict the concept of trust boundaries, isolation, threats affecting each asset, and recommended countermeasures. Threats can be classified into people, process, or technology\n d. post threat modeling, a comprehensive security pattern* detailing the security requirements, should be created. Security requirements should consider threats identified, potential weaknesses, regulatory requirements, and recommend controls for the Prevention, Detection, Response or Recovery of an asset that will store, process or transmit data. Note: NIST's Identify, Protect, Detect, Response, and Recover model has been applied here as a recommended baseline\n e. Privacy requirements should be created for all stages of the SDLC, from feasibility study to design to build to run (operationalize) to maintenance\n f. Privacy requirements should be created for every component in the design; this includes but is not limited to all technology assets in scope of the design & network connectivity between those assets\n g. Privacy requirements should cover scenarios that involve People (e.g. user education, customer education), Process (e.g. how will authorized business stakeholders access data subject to privacy regulations) & Technology (e.g. All JSON Web Tokens should contain a Scope section that ensures that every operation on data requires Authentication & Authorization from the Data subject)\n h. Privacy by design requirements should ensure that they align with regulatory requirements in the respective jurisdiction of the organization. \n \n Recommended privacy by design requirements include (but are not limited to):\n i. Data Minimization, specifically during the collection of data for the purposes of ensuring alignment to privacy regulations\n j. Privacy notices covering what data will be collected, how it will be used, who will have access to the data, with whom it will be shared or disclosed (including 3rd parties), how long it will be retained, how it will be protected,. From an implementation perspective, privacy notices can take the form of Pop-Ups, banners, layered notices or similar\n k. Additional concepts such as Consent, Choice, Collection Limitations, Data Quality, Reliable Sources, Primary & Secondary Uses, Internal & External Disclosure\n l. Data Subject Access and under what conditions it will be provided (e.g. how data subjects can access and/or export their data and how they can contact the CSP with questions or concerns around privacy)\n m. Technologies that deploy Privacy Enhancing Techniques (PET) such as Non-Perturbation (e.g. Masking, Suppression, Generalisation or Pseudonymisation), Perturbation (e.g., Noise Addition or Micro Aggregation) , Cryptography (e.g. Encryption techniques such as Homomorphic, Format Preserving, Deterministic, Order-Preserving) and Privacy Models such as k-anonymity, I-diversity or similar\n n. Rules around how data will be protected during Cross Border transfers should be considered based on regulatory requirements\n o. The default/out-of-the-box settings should align with the applicable regional privacy regulations. Examples include but are not limited to the following: \n i. explicit consent/choice based manual opt-in, wherein the data subject should manually tick a box or perform some action to explicitly consent, should be the privacy by default option available as opposed to automatic opt-in, which then requires manual opt-out by a data subject \n • Regarding cookies, only strictly necessary ones should be auto-enabled, while additional cookies of other types should be auto-disabled. Explicit consent from the data subject should be requested in the event additional cookies (other than strictly necessary cookies) need to be enabled\n • Enabled by default, graphical user interfaces (GUI) should conduct data collection (e.g., via a web form) by requesting only the absolute minimum data required (e.g., if only age range is required based on legitimate use principles, specific age should not be available in the drop down menu) aka data minimization\n • by default, privacy notices (either simple or layered) should be displayed each and every time information is requested from the data subject\n p. CSPs should ensure that MSAs with their respective sub-contractors or dependent parties contain the requisite data privacy clauses (e.g., data breach notification clauses such as \"The CSP should inform the CSC of a data breach within a reasonable timeframe/with immediacy as per required regulations or based on instruction from the CSC” (e.g., if the CSC is the data controller)\n q. Privacy by design controls should be baked into every phase of the data lifecycle, from creation to use, sharing, archival and destruction",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply.\n \n In addition, the below apply exclusively for the CSC:\n a. all required privacy requirements should be prescribed in checklists that are used for selection of a CSP (RFP, RFQ)\n b. special attention should be paid for privacy requirements for scenarios that cover data migration (e.g., from legacy systems to microservice-based implementations, or from production to test environments\n c. Master Service Agreements (MSA) should contain clauses that cover privacy requirements that include but are not limited to the specific privacy requirements mandated by the regulator in the specific jurisdiction, general privacy requirements that assist with implementation of controls that reduce technical debt or mitigate privacy risk in the long term, and those that apply to the CSP's subcontractors and/or dependent parties (in order to cover supply chain risks)\n d. Send a list of the CSC’s preferred privacy clauses to the CSP as part of the checklists in the RFP/RFQ that will be executed to select a specific CSP. Sample privacy clauses include but are not limited to: \n i. data breach notification (e.g., the CSP should inform CSC of a data breach within 48 hours in order meet its own commitment of informing the local regulator within 72 hours, or within a reasonable timeframe/with immediacy in order to meet its own commitment of informing the local regulator within the specified limit\n ii. specific data protection requirements that should apply to the CSP (as a data processor) and its subcontractors and dependent parties, \n iii. cross-border regulation requirements"
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Protection Impact Assessment",
        "Control ID": "DSP-09",
        "Control Specification": "Conduct a Data Protection Impact Assessment (DPIA) to evaluate the\n origin, nature, particularity and severity of the risks upon the processing\n of personal data, according to any applicable laws, regulations and industry\n best practices.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n The control ownership is defined as “Shared (Dependent).” Shared, because the CSC typically acts as data controller, and in most instances owns the data that it puts in the CSP’s cloud. As a Data Controller, they are obliged, depending on certain conditions (e.g., data processing activities that could potentially result in high risk to the rights and freedoms of individuals) to carry out a Data Protection Impact Assessment (DPIA). The CSP performs a DPIA because personal data may be sent to the cloud from the CSC. \n \n Dependent, because the CSC may need to assess the tools and technologies available from the CSP that can be used as measures (e.g., safeguards, security mechanisms) to mitigate risk, which is one of the stages of the DPIA before recording outcomes and providing sign offs. The CSP on the other hand is dependent on the CSC, because it takes the CSC's DPIA as input, in order to understand how the CSC processes personal data. The CSP incorporates this into its security and privacy by design and default approaches by incorporating features into products and tools that they can offer other CSCs in the future so that they can meet the commitments of their DPIAs.\n \n Implementation Guidelines.\n Applicable to all service models:\n Data Protection Impact Assessments (DPIAs) should cover the following concepts: \n a. Description of the nature of data processing activities (e.g. how will data be collected, used, stored and deleted, who will it be shared with, who will have access to it, how long it will be retained)\n b. Description of the scope of the processing (e.g. nature of the data, special categories of data, volume of data that will be collected, retention periods, the extent frequency of collection, the number of data subjects involved, the duration of the processing and the geographical area covered)\n c. Description of the context of data processing (e.g. the source of the data, nature of relationship with the individual or data subject, level of control that data subjects will have, prior experiences of this type of processing, issues of public concern)\n d. Description of the purposes of data processing (e.g.legitimate interest, the objective of data processing, benefits of the processing, impact on data subject)\n e. Considerations on how to consult with relevant stakeholders (e.g., consultation from information security experts, seeking advice and counsel from specific individuals, groups or organizations)\n f. description of compliance and proportionality measures (e.g. lawful basis, ensuring data quality & minimisation)\n g. Identify & assess risks and potential impact to individuals or data subjects (e.g., likelihood - remote, possible or probable and severity - minimal, significant or catastrophic of harm and overall risk - low, medium or high). Examples of potential impacts include but are not limited to inability to exercise rights (including but not limited to privacy rights), inability to access services or opportunities, loss of control over the use of personal data, discrimination, identity theft or fraud, financial loss, reputational damage, physical harm, re-identification of pseudonymised data; or any other significant economic or social disadvantage\n h. Identify measures(e.g. safeguards, security mechanisms or any other mechanism to ensure protection of personal data) to to reduce or eliminate inherent risks and agree on a value for the residual risk (e.g. low, medium or high). Examples of risk mitigation include but are not limited to deciding not to collect certain types of data;reducing the scope of the processing;reducing retention periods;taking additional technological security measures;training staff to ensure risks are anticipated and managed; anonymising or pseudonymising data where possible;writing internal guidance or processes to avoid risks;using a different technology;putting clear data-sharing agreements into place;making changes to privacy notices;offering individuals the chance to opt out where appropriate; or implementing new systems to help individuals to exercise their rights.\n i. Record outcomes and sign off on the measures & residual risks approved\n j. It is recommended to use DPIA templates to record the DPIA processes and outcomes. A recommended template from the Information Commissioner's Office (ICO) can be found at https://gdpr.eu/wp-content/uploads/2019/03/dpia-template-v1.pdf\n k. The DPIA should be conducted before beginning any data processing activity. It is recommended, for instance, to conduct the DPIA, before and during the planning stages of a new project or initiative\n l. DPIAs should be reviewed at least once annually OR if a change in risk is envisaged as a result of data processing\n m. Where required and necessary, the advice of a Data Protection Officer (DPO) should be taken when carrying out a DPIA. DPIAs should be carried out for both, CSC Data , Service Data (or Service-Generated Data)* & Support Data**\n \n Notes: \n It is recommended to carry out an Initial Screening Assessment (ISA) during a process such as Data Classification (at the start of a project) prior to moving on to DPIAs. This is to ensure a privacy review is conducted on how processing will work regardless, as there may be instances where a DPIA isn't deemed necessary based on there being no significant risk to data subjects, which is determined in an ISA).\n * Service data can be defined as personal information that the CSP collects or generates via the provisioning of certain services or data derived via the operation of a service (e.g. user or performance data).\n ** Support data can be defined as data provided to the CSP by the CSC to to obtain technical support for services offered by the CSP.",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Sensitive Data Transfer",
        "Control ID": "DSP-10",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures that ensure any transfer of personal or sensitive data is protected\n from unauthorized access and only processed within scope as permitted by the\n respective laws and regulations.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a “Shared (Independent)” control for both the CSP and CSC because both should define processes, procedures, and technical measures (strong encryption or similar techniques) for data transfer – consider data transfer within the organization and externally – to prevent unauthorized access by eavesdropping or data transfer interception.\n \n Implementation Guidelines.\n Applicable to all service models:\n Control implementation is not service delivery model specific (IaaS, PaaS, or SaaS). Irrespective of service delivery model, the CSP is responsible for implementing technical measures for data transfer within and outside the organization.\n \n Recommendations to the CSP are: \n a. the CSP should only store and process data in jurisdictions mandated by specific data protection laws and regulations and as specified by the data controller (CSC)\n b. data transfer agreements and data processing and security terms as permitted by respective laws and regulations should be documented to detail security measures to protect against unauthorized personal or sensitive data access. Define roles and responsibilities for authorization and regulatory compliance; processor and controller responsibilities (as per regulations); processor customers responsibilities (as per regulations).\n c. security measures involving transfer of personal or sensitive data to protect against unauthorized personal or sensitive data access should be documented.\n d. If third party or subprocesses are involved in processing of customer's personal or sensitive data, impact assessment as related to personal data should be performed. Contracts, SLAs, and vendor internal policies should be reviewed to manage risks associated with security, availability, and confidentiality involving third parties.\n e. Requirements should be specified for customers, suppliers, and third parties in contract terms to implement appropriate safeguards such as:\n i. access restrictions to protect information from unauthorized access, use, and disclosure (i.e., authorize its employees, contractors, and sub-processors to access customer data only as strictly necessary to comply with Instructions)\n ii. take appropriate steps to ensure compliance with the security measures by its employees, contractors and sub-processors to the extent applicable to their scope of performance, and to ensure that all persons authorized to process customer data are under an obligation of confidentiality\n iii. use TLS to protect data when in transit between the cloud services and the CSC. Use protection of connections by unique keys, which are RSA-based 2048-bit key lengths. If an API is involved as a data transfer mechanism, mutual TLS is recommended\n iv. deletion terms such as deletion by customer, return or deletion when term ends, deferred deletion Instruction\n v. help ensure ongoing confidentiality, integrity, availability and resilience of systems and services\n vi. help restore timely access to customer data following an incident and for regular testing of effectiveness\n vii. incident notification to customers promptly and without undue delay after becoming aware of a data incident, and promptly take reasonable steps to minimize harm and secure customer data\n viii. ensure compliance certifications and SOC reports are obtained and maintained\n ix. specify customer responsibilities, access to data, subject rights and data export, and data transfers\n x. datacenter and network security \n xi. data storage, isolation and logging\n xii. access control\n xiii. decommissioned data assets and data assets erase policy\n xiv.personnel security (i.e., conducts reasonably appropriate background checks to the extent legally permissible and in accordance with applicable local labor law; execute a confidentiality agreement, and acknowledge receipt of, and compliance with company's confidentiality and privacy policies; personnel provided with security training; personnel handling customer data to complete additional requirements appropriate to their role (e.g., certifications); personnel not processing customer data without authorization)\n xv. sub-processor security (i.e., conduct an audit of the security and privacy practices of sub-processors to ensure they provide a level of security and privacy appropriate to their access to the data and the scope of the services they are engaged to provide)\n xvi. For personal and sensitive data transfers between the EU and non-EU, the CSP should ensure the following:\n • The country where the data is being transferred to has been deemed by the EU to have adequate data protection laws\n • Binding Corporate Rules are defined and established\n • Standard contractual clauses are established and implemented\n • Explicit consent from the individuals whose data is being transferred is obtained\n • Legal obligations under the local laws of the destination country, including any requirements to disclose data to government entities are considered, reviewed and incorporated\n • Suitable technical and organizational measures to ensure the security and confidentiality of the data being transferred and processed are implemented",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n Applicable to all service models:\n Irrespective of service delivery model, the CSC is responsible for implementing technical measures for data transfer within and outside the organization.\n \n Recommendations to the CSC are: \n a. responsible for the management of the data its places in the CSP’s services\n b. ensure the CSP has no insight into the type of content the CSC chooses to place into the cloud and retain complete control of how it chooses to classify its content, where it is stored, used, and protected from disclosure. This can be done by implementing technical security measures such as bring your own key (BYOK) encryption\n c. ensure SoD by implementing the 'duality' or 'four eyes' principle. Where separation cannot be implemented, apply appropriate mitigation controls\n d. responsible for complying with privacy regulations\n e. implement appropriate safeguards for customers, suppliers, and third parties, such as contract terms and access restrictions to protect against unauthorized access, use, and disclosure\n f. where applicable, conduct an audit or an CSC-appointed independent auditor (including inspections) to verify the CSP’s compliance, by requesting reviews of the CSP’s SOC 2 report, security addendum, or security terms under Right to Audit Clause obligations\n g. warrant on an ongoing basis that the relevant controller has authorized:\n i. the Instructions\n ii. appointment of processor\n iii. review CSP's engagement of sub-processors, inclusive of opportunity to object to sub-processor changes\n h. immediately forward to the relevant controller any notice provided by CSP under provisions of Instruction notifications / Incident notification/responsibility for requests"
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Personal Data Access, Reversal, Rectification and Deletion",
        "Control ID": "DSP-11",
        "Control Specification": "Define and implement, processes, procedures and technical measures\n to enable data subjects to request access to, modification, or deletion of their\n personal data, according to any applicable laws and regulations.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a “Shared (Independent)” control for both the CSP and CSC because they should each define processes, procedures, and technical measures for data subjects to be able to access, view, rectify, or delete their personal data in the system, or by logging a request with the CSP. The CSP should respond to such requests in alignment with relevant data protection laws.\n \n Implementation Guidelines.\n Applicable to all service models:\n Control implementation is not service delivery model specific (IaaS, PaaS, or SaaS). Irrespective of service delivery model, the CSP is responsible for defining processes, procedures, and technical measures for the data subject to be able to access, view, rectify, or delete their personal data in the system, or by logging a request with the CSP.\n \n Recommendations to the CSP are: \n a. establish a process for individual data subjects to have the right of access to their data, and publish as privacy-statement and / or global privacy practices. The privacy policy should identify the personal data that the CSP may receive from business contacts including users of the CSP's services, website visitors, and individuals working on behalf of the CSP's customers, vendors, and partners. The policy explains how the CSP uses this information and the choices available to individuals to understand and control the retention and use. The external privacy policy should include an explanation of how the CSP honors data subject requests for data they hold as a controller\n b. under the GDPR organizations are obligated to respond to data subject rights requests within 30 days. The CSP should honor all such consumer requests, after authorization from the CSC (where CSC is the data controller) even if the laws of a data subject’s country do not explicitly grant these rights to data portability, and rights to access, correct, and delete personal data. The data subject rights include the ability to: \n i. delete personal data - requests could range in size from all data to just one data point \n ii. access personal data - view data within a service or in a download \n iii. export personal data - receive a copy of it in a downloadable format \n iv. object to personal data processing - claim the CSP does not have a right to use the data \n v. Restrict personal data - ask the CSP to hold a copy of their data on their behalf \n Note: Depending on the type of data subject, there are different mechanisms for exercising these rights.\n c. The process and procedure for requesting access, deletion, modification of CSC personal data should be governed by agreement with customers (e.g., MSA). The CSPs may also be allowed to request and collect information about authorized users of our products or services for reasons of contract management (Note: The MSA may also contain a link to the Data Processing Agreement (DPA), which covers Privacy clauses)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n Irrespective of service delivery model, the CSC is responsible for defining processes, procedures, and technical measures for the data subject to be able to access, view, rectify, or delete their personal data in the system, or by logging a request with the CSC.\n \n Recommendations to the CSC are: \n a. manage the data it places into the IaaS CSP's cloud. The CSP has no insight as to what type of content the CSC chooses to store in the cloud, and the it retains complete control of how it chooses to classify their content, where it is stored, used, and how it is protected from disclosure\n b. establish an easy-to-use portal to allow for individual data subjects to make requests, to have the right of access to their data, to publish as a privacy-statement, and / or global privacy practices. The privacy policy should identify the personal data that the CSC may receive from business contacts, website visitors, and individuals working on behalf of its customers, vendors, and partners. The policy should explain how the CSC uses this information and the choices available to understand and control the retention and use. The external privacy policy should include an explanation of how the CSC honors data subject requests for data they hold as a processor\n c. under the GDPR, organizations are obligated to respond to data subject rights requests within 30 days. The CSC should honor all such consumer requests, even if the laws of a data subject’s country do not explicitly grant these rights to data portability, and rights to access, correct, and delete personal data. The data subject rights include the ability to: \n i. delete personal data - requests could range in size from all data to just one data point \n ii. access personal data - view data within a service or in a download \n iii. export personal data - receive a copy of it in a downloadable format\n iv. object to personal data processing - claim the CSC does not have a right to use data\n v. Restrict personal data - ask the CSC to hold a copy of their data on their behalf \n Note: Depending on the type of data subject, there are different mechanisms for exercising these rights."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Limitation of Purpose in Personal Data Processing",
        "Control ID": "DSP-12",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures to ensure that personal data is processed according to any applicable\n laws and regulations and for the purposes declared to the data subject.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a “Shared (Independent)” control for both the CSP and CSC because they each should define processes, procedures, and technical measures to ensure the following:\n a. the data subject is made aware of the nature and purpose of information collection\n b. the information is relevant and limited to processing requirements\n c. processing is performed in a reasonable manner that does not infringe upon the data subject's privacy\n d. processing is for a specific, explicitly defined, and lawful purpose related to a function or activity of the responsible party.\n e. where the controller intends to further process the personal data for an alternative purpose to which the personal data was collected, the data subject should be informed of the purpose and provide consent aforehand\n f. information is stored only as long as required\n \n Implementation Guidelines.\n Applicable to all service models:\n The control implementation is not service delivery model specific (IaaS, PaaS, or SaaS). Irrespective of service delivery model, the CSP is responsible for defining processes, procedures, and technical measures for limitation of purpose in personal data processing.\n \n Recommendations for the CSP are: \n a. establish a formal Data Subject Access Request (DSAR) according to GDPR or other applicable regulations\n b. detail its agreements to ensure personal data is processed per applicable laws and regulations and for the purposes declared to the data subject in the data processing and security terms\n c. terms of the DPA address the EU Model Clauses, which fulfill the manner in which the CSP processes personal data for its customers\n d. the CSP is considered a processor and not a controller of personal data\n e. ensure legal team and compliance team monitor regulatory obligations\n f. implementation technical measures to ensure compliance with applicable export regulations related to cryptographic controls, use activity logs and reports to determine compliance with existing internal authentication and hardware policies. The CSC can choose a preferred data-at-rest storage region. Standard Contractual Clauses (SCCS) are to be in place for data transfers\n g. implement and enforce policies and standards designed to ensure that processing of personal data is conducted in compliance with applicable laws and regulations\n h. Conducts or contracts with third parties to conduct regular assessments and audits to help ensure that the policies and standards and these applicable laws and regulations are followed.",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n Applicable to all service models:\n The control implementation is not service delivery model specific (IaaS, PaaS, or SaaS). Irrespective of service delivery model, the CSC is responsible for defining processes, procedures, and technical measures for limitation of purpose in personal data processing.\n The implementation guidelines provided for the CSP apply.\n \n Additional recommendations for the CSC are:\n a. manage the data (including adhering to applicable laws and regulations) it places into the CSP's services\n b. implement measures to ensure that the CSP has no insight into what type of content the CSC chooses to store in CSP's environment, and for the CSC to retain complete control of how it chooses to classify the content, where it is stored, used, and protected from disclosure\n c. ensure to supply the CSP with up-to-date and accurate information\n d. design, develop, test, implement, operate, and maintain administrative and technical safeguards to prevent or detect unauthorized access, use, and disclosure during input, processing, retention, output, and disposition of data to, within, or from its applications"
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Personal Data Sub-processing",
        "Control ID": "DSP-13",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures for the transfer and sub-processing of personal data within the service\n supply chain, according to any applicable laws and regulations.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a “Shared (Independent)” control for both the CSP and CSC because both should define processes, procedures, and technical measures for the transfer and sub-processing of personal data within the service supply chain, according to any applicable laws and regulations.\n \n Implementation Guidelines.\n Applicable to all service models:\n Control implementation is not service delivery model specific (IaaS, PaaS, or SaaS). Irrespective of cloud service delivery model, the CSP is responsible to define processes, procedures, and technical measures for Personal Data Sub-processing\n \n Recommendations to be implemented by CSP are: \n a. details its agreements for the transfer and subprocessing of personal data within the service supply chain per laws and regulations in the Data Processing and Security Terms. Also, define processes, procedures, measures and follow best practices to integrate systems impacted by Mergers & Acquisition\n b. consent to sub-processor Engagement: the CSP requests the CSC to authorize the engagement as sub-processors per the information (Names, locations and activities of sub-processors) provided about sub-processors\n c. requirements for sub-processor Engagement are specified such that when engaging any sub-processor, the CSP will ensure via a written contract that:\n d. the sub-processor only accesses and uses Customer Data to the extent required to perform the obligations subcontracted to it, and does so in accordance with the applicable Agreement; and\n e. if the processing of Customer Personal Data is subject to European Data Protection Law, the data protection obligations described and are imposed on the sub-processor; and remain fully liable for all obligations subcontracted to, and all acts and omissions of, the sub-processor\n f. When any new sub-processor is engaged during the Term, the CSP will, at least 30 days before the New sub-processor starts processing any Customer Data, notify the CSC of the engagement (including the name, location and activities of the new sub-processor)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n Applicable to all service models:\n Control implementation is not service delivery model specific (IaaS, PaaS, or SaaS). Irrespective of cloud service delivery model, the CSP is responsible to define processes, procedures, and technical measures for Personal Data Sub-processing\n \n Recommendations to be implemented by the CSC are:\n a. manage the data it places into the CSP’s services\n b. since the CSP has no insight as to what type of content the customer chooses to store in the CSP's environment, retain complete control of how it chooses to classify the content, where it is stored, used, and protected from disclosure\n c. consent to sub-processor engagement. The CSC specifically authorizes the engagement of sub-processors disclosed by the CSP after reviewing their names, locations and activities\n d. when any new sub-processor is engaged during the term, the CSC may, within 90 days after being notified of the engagement of a new sub-processor by CSP, object by immediately terminating the applicable agreement for convenience by notifying the CSP\n e. design, develop, test, implement, operate, and maintain administrative and technical safeguards to prevent or detect unauthorized access, use, and disclosure during input, processing, retention, output, and disposition of data to, within, or from their applications"
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Disclosure of Data Sub-processors",
        "Control ID": "DSP-14",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures to disclose the details of any personal or sensitive data access by\n sub-processors to the data owner prior to initiation of that processing.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a Shared (Independent) control for both the CSP and CSC because both should define processes, procedures, and technical measures for defining, implementing, and evaluating disclosure of the details of any personal or sensitive data accessed by sub-processors to the data owner prior to initiating that processing.\n \n Implementation Guidelines.\n Applicable to all service models:\n The control implementation is not service delivery model specific (IaaS, PaaS, or SaaS). Irrespective of cloud service delivery model, the CSP is responsible for defining processes, procedures, and technical measures for disclosure of data to sub-processors.\n \n Recommendations to the CSP are: \n a. detail the disclosure of any personal or sensitive data by sub-processors prior to initiating the processing, through the data processing and security terms agreed upon by the CSC and CSP\n b. ensure processing is as per the policies and procedures in the CSP's data protection addendum\n c. cover in the privacy policy the practices that the CSP and its subsidiaries and affiliates employ when providing support, consulting, cloud or other services to the CSC. Establish this privacy policy in order to clarify that the use of information to which it may be provided access to provide services is more limited than the use of information covered by CSP's general privacy policy\n d. work with third-party subcontractors to provide website, application development, hosting, maintenance, backup, storage, virtual infrastructure, payment processing, analysis and other services. These service providers may have access to or process personal data for the purpose of providing those services\n e. disclose to its relevant customers any use of subcontractors who may process the personal data before processing occurs. An external facing list of subcontractors who work with the CSP should be provided. Invite visitors to subscribe to an RSS feed that notifies them when new sub-processors are introduced\n f. where a sub-processor will process personal data subject to EU data protection laws, the CSP should ensure that the sub-processor is subject to contractual obligations regarding Personal Data which satisfy the requirements of EU data protection laws",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n Applicable to all service models: \n The control implementation is not service delivery model specific (IaaS, PaaS, or SaaS). Irrespective of cloud service delivery model, the CSP is responsible for defining processes, procedures, and technical measures for disclosure of data to sub-processors.\n \n Recommendations to the CSC are:\n a. manage the data it places into the CSP’s services\n b. since the CSP has no insight as to what type of content the customer chooses to store in the CSP's environment, retain complete control of how it chooses to classify the content, where it is stored, used, and protected from disclosure\n c. consent to sub-processor engagement. The CSC specifically authorizes the engagement of sub-processors disclosed by the CSP after reviewing their names, locations and activities\n d. when any new sub-processor is engaged during the term, the CSC may, within 90 days after being notified of the engagement of a new sub-processor by CSP, object by immediately terminating the applicable agreement for convenience by notifying the CSP\n e. design, develop, test, implement, operate, and maintain administrative and technical safeguards to prevent or detect unauthorized access, use, and disclosure during input, processing, retention, output, and disposition of data to, within, or from their applications"
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Limitation of Production Data Use",
        "Control ID": "DSP-15",
        "Control Specification": "Obtain authorization from data owners, and manage associated risk\n before replicating or using production data in non-production environments.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a “Shared (Independent)” control for both the CSP and CSC because both should perform due diligence before replicating or using production data in non-production environments (and periodically thereafter, commensurate with the risk level of the third-party relationship).\n \n Implementation Guidelines.\n Applicable to all service models:\n Irrespective of cloud service delivery model, the CSP is responsible for preventing or replicating the use of production data.\n \n Recommendations for the CSP are: \n a. maintain policies and processes for governance and oversight of the infrastructure/platform/application\n b. define physical and logical network boundaries to ensure production data remains in the boundary of the production network\n c. enforce change controls policies and processes\n d. ensure SSDLC coding practices, quality testing, coding scanning, network and application penetration testing, code deployment, code backups, and integrated code testing\n e. establish procedures requiring that production data not be used in non-production environments without sanitization, anonymization, pseudonymization, obfuscation, truncation, tokenization, or replacing with dummy data as applicable\n f. segregate duties to require business approval to access an environment\n g. base physical and logical access to the production cloud environment on the principle of least privilege \n h. physically secure datacenters including hardware management, datacenter security training, and access alarms\n i. provide periodic awareness training on security, privacy, secure infrastructure management, and coding practices to employees\n j. timely termination of employees\n k. enforce asset inventory tracking, secure configuration management, automated vulnerability scanning, and patch management\n l. continuously log and audit system access, with correlation and alerting\n m. perform regular compliance audits to ensure control effectiveness",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n Applicable to all service models:\n Irrespective of cloud service delivery model, the CSC is responsible for preventing or replicating the use of production data.\n \n The CSC is responsible for defining policies and establishing controls for how its production data is maintained with regards to replication or high availability and the demarcation of their production environment. \n \n Recommendations for the CSC are:\n a. design, develop, test, implement, operate, and maintain administrative and technical safeguards to prevent or detect unauthorized access, use, and disclosure during input, processing, retention, output, and disposition of data to, within, or from its applications.\n b. ensure appropriate logging for events such as administrator activity, system errors, authentication checks, data deletions etc. are in place to support monitoring and incident response processes\n c. enable and configure service-specific logging features where available for all services and implement appropriate monitoring and incident response processes\n d. be responsible for network and firewall configuration\n e. be responsible for client-side data encryption and data integrity, server side encryption (file system and/or data), and persistence\n f. transmit secret keys over secure channels. Customers should avoid embedding secret keys in web pages or other publicly accessible source code. Customers should encrypt sensitive data at rest as well as in transit over the network\n g. appropriately configure and manage usage and implementation of available encryption options to meet customer requirements\n h. ensure TLS connections, integrity validations (checksums), and identity checks for networking traffic\n i. opt in for annual key rotation for CMKs\n j. specify in contract and establish procedures which require that production data not be used in non-production environments without sanitization, anonymization, pseudonymization, obfuscation, truncation, tokenization, or replacing with dummy data as applicable"
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Retention and Deletion",
        "Control ID": "DSP-16",
        "Control Specification": "Data retention, archiving and deletion is managed in accordance with\n business requirements, applicable laws and regulations.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a “Shared (Independent)” control for both the CSP and CSC because both should ensure data retention, archiving, and deletion is managed in accordance with business requirements, and applicable laws and regulations (and periodically thereafter, commensurate with the risk level of the third-party relationship).\n \n Implementation Guidelines.\n Applicable to all service models:\n The control implementation is not service delivery model specific (IaaS, PaaS, or SaaS). Irrespective of cloud service delivery model, the CSP is responsible for ensuring retention and deletion practices encompassing both physical and electronic data.\n \n Recommendations to the CSP are: \n a. define an information protection policy to set forth the requirements for classifying and handling confidential information, including requirements for visual disclosure. This policy should apply to all confidential information, whether the information belongs to the CSP, its customers, or the CSP's third party. This policy should be reviewed and revised by the legal team at least annually\n b. maintain data retention, archiving, and deletion policies and procedures in accordance with regulatory, statutory, contractual, and business requirements in order to continue operations of the CSP’s services\n c. the CSP should detail its agreements for data deletion (including retention) and data export per applicable laws and regulations in the data processing and security terms\n d. the CSP should ensure critical system components, including audit evidence and logging records, and backup and redundancy programs are maintained, monitored, reviewed, and validated at least annually for disaster recovery purposes\n e. the CSP should provide tools to securely delete data including removing indices from the primary location of any geo-replicated copy asynchronously. Data wiping should be NIST 800-88 compliant. Destruction of data should include secure erasure of media and secure disposal of records so the information cannot be read or reconstructed\n f. the CSP should follow a decommissioning process that is designed to destroy a defective disk to the point that data cannot be reasonably recovered. Where applicable, if a managed service provider is used for secure destruction, then a certificate of destruction should be obtained\n g. the CSP should promptly comply to the extent practicable with written requests to destroy \"Maintained Customer Data\" within agreed time periods and provide written certification of destruction of \"Maintained Customer Data\" upon the CSC’s written request\n h. the CSP should delete customer data from CSP support services systems upon termination of the support services investigation, including deletion of data from the secure FTP site, databases, hard drives, and virtual machines, and delete virtual meeting sessions, provided that correspondence between the CSP and CSC had been retained",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n Applicable to all service models: \n The control implementation is not service delivery model specific (IaaS, PaaS, or SaaS). Irrespective of cloud service delivery model, the CSC is responsible for ensuring retention and deletion practices encompassing both physical and electronic data.\n \n Recommendations to the CSC are: \n a. the CSC should be responsible for scheduling and configuring data backups manually, as needed\n b. the CSC should be responsible for maintaining all required policies and procedures relevant to their own environment\n c. the CSC is responsible for implementing a backup and/or replication process in line with its requirements and policies\n d. the CSC arise responsible for designing, developing, testing, implementing, operating, and maintaining administrative and technical safeguards to prevent or detect unauthorized access, use, and disclosure during input, processing, retention, output, and disposition of data to, within, or from its applications\n e. the CSC should be responsible for enforcing its own data retention policies, while the CSC provides a predefined period (in days) for subscription and storage account deletion to prevent accidental data loss\n f. the CSC should retain control and ownership of its data, and is responsible for enforcing its data retention policies according to its requirements. Where applicable, the CSC’s administrators and users with the ability to permanently delete their data should delete it accordingly"
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Sensitive Data Protection",
        "Control ID": "DSP-17",
        "Control Specification": "Define and implement, processes, procedures and technical measures\n to protect sensitive data throughout it's lifecycle.",
        "Control Ownership by Service Delivery Model - IaaS": "CSP-Owned",
        "Control Ownership by Service Delivery Model - PaaS": "CSP-Owned",
        "Control Ownership by Service Delivery Model - SaaS": "CSP-Owned",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a CSP-owned control because customer data security is a top priority, and several different mechanisms should be in place to ensure sensitive data is protected throughout its lifecycle. \n \n Implementation Guidelines.\n Applicable to all service models: \n The control implementation is not service delivery model specific (IaaS, PaaS, or SaaS). Irrespective of the cloud service delivery model, the CSP is responsible for ensuring that mechanisms are in place to protect data throughout its lifecycle.\n \n Recommendations to the CSP are: \n a. the CSP should publish a privacy statement and explain its processes for handling sensitive data. This should be official, signed, legally valid, and issued pursuant to federal or local law and rules. Some of the attributes to be covered in the process are:\n i. important definitions such as “personal data”, “data subject”, “processing”, “controller” and “processor,” etc.\n ii. scope of data protection law\n iii. roles and responsibilities of processor, controller and customer\n iv. scope of processing, such as it only collects and stores the customer’s user credentials, which includes: first name, last name, username, and password. Do not store, process, or transmit sensitive data like birthdate, personal address, social security number, health information, financial data (SOX) or credit card information\n v. data deletion: deletion by customer, return or deletion when term ends, deferred deletion instruction\n vi. security measures, controls and assistance: Access and compliance, encryption, use of unique encryption keys for each customer to ensure that customer data is logically separated within the service, data in production is completely segmented from the development, testing, staging, and corporate environments. Use of Trusted Execution Environments (TEEs) for data in use, No customer production data is used in test or development environments. If it is deemed absolutely necessary to use Production Data for the purposes of Testing, then controls that are exactly the same as the Production environment must be applied and replicated.\n vii. all virtual machine instances within the production environment are allow-listed to only communicate with each other on specific ports and protocols, implement IDS/IPS and strict firewalling at the hypervisor and guest instance layers, no outbound communication is permitted that originates from the production environment, network layer controls ensure that privileged access is always enforced through allow-listed IPs and hosts, using encrypted VPN tunnels through non-standard ports, technical operations personnel are assigned an SSH key pair to authenticate to the production environment, second-factor authentication is provided by a physically separate hardware MFA token, implementation of transaction monitoring on the databases to detect abnormal queries or large exports of customer data, monitoring all outbound traffic from the CSP's production environment for anomalies using both proprietary and commercial traffic monitoring and intrusion detection systems, sending alerts to both technical operations and security, do not store customer data outside of the service's production environment, and do not permit the exporting of customer data onto removable media or mobile devices, datacenter security, networks and transmission, and personnel security\n viii. data incident management\n ix. customer’s security responsibilities \n x. compliance certifications and SOC reports\n xi. customer’s audit rights\n xii. access etc.; data subject rights; data export\n xiii. data transfers\n xiv. use of sub-processors\n b. where and when applicable, the CSP should implement Information rights management technology for all sensitive data\n c. the CSP should require a subpoena or its equivalent before disclosing non-content, and only disclose content to law enforcement in response to a warrant (or its local equivalent)\n d. the CSP should redirect the government and other regulatory authorities to seek data from the CSC itself when legally permitted\n e. the CSP should establish a process to capture all law enforcement requests through a secure portal, for which only vetted law enforcement agencies receive access. Once the CSP reviews the demand and determines that it should provide data, the data specified in the valid legal order should be provided to law enforcement through the same secure portal\n f. the CSP should design an acceptable use policy (AUP) for systems and resources to help its employees, suppliers, contractors and partners protect the security and integrity of information and its systems and resources, and specify on how they may, and may not, use systems and resources while performing their job duties",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n Not applicable for the CSC.\n \n Implementation Guidelines.\n Applicable to all service models: \n The CSC retains control and ownership for its customer content and is responsible for disclosing details to data owners of any personal or sensitive data access by sub-processors before processing begins."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Disclosure Notification",
        "Control ID": "DSP-18",
        "Control Specification": "The CSP must have in place, and describe to CSCs the procedure to\n manage and respond to requests for disclosure of Personal Data by Law Enforcement\n Authorities according to applicable laws and regulations. The CSP must give\n special attention to the notification procedure to interested CSCs, unless otherwise\n prohibited, such as a prohibition under criminal law to preserve confidentiality\n of a law enforcement investigation.",
        "Control Ownership by Service Delivery Model - IaaS": "CSP-Owned",
        "Control Ownership by Service Delivery Model - PaaS": "CSP-Owned",
        "Control Ownership by Service Delivery Model - SaaS": "CSP-Owned",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a CSP-owned control because the CSC’s privacy is top priority. The CSP should have a policy that prohibits the disclosure of the CSC’s data unless it is required to do so to comply with the law, or with a valid and binding order of a governmental or regulatory body. The CSP should notify the CSC before disclosing CSC content to law enforcement authorities so that they can seek protection from disclosure.\n \n Implementation Guidelines.\n Applicable to all service models:\n Irrespective of cloud service delivery model, the CSP is responsible for having a policy that prohibits the disclosure of the CSC’s data unless required to do so to comply with the law, or with a valid and binding order of a governmental or regulatory body.\n \n Recommendations to the CSP are:\n a. the CSP should define a policy and process in line with applicable laws and regulations that specifies requirements for responding to requests for access to confidential information from third parties, evaluating whether the access requests are legally mandatory, and determining appropriate actions including any required notices or disclosures to the public, CSCs, affected individuals, or law enforcement authorities\n b. the CSP should address the need for transparency to the CSC by regularly publishing a report about the types and volume of information requests received\n c. the CSP should designate a legal team to maintain appropriate contacts with relevant authorities (e.g., regulators, law enforcement, government officials) and industry bodies such as security, risk, compliance and policy organizations to evaluate the list of requests on a regular basis and seek guidance as required",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n Not applicable for the CSC.\n \n Implementation Guidelines.\n The CSC is responsible for designing, developing, testing, implementing, operating, and maintaining administrative and technical safeguards to prevent or detect unauthorized access, use, and disclosure during input, processing, retention, output, and disposition of data to, within, or from its applications."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Location",
        "Control ID": "DSP-19",
        "Control Specification": "Define and implement, processes, procedures and technical measures\n to specify and document the physical locations of data, including any locations\n in which data is processed or backed up.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a “Shared (Dependent)” control for both the CSP and CSC because the CSP will ensure where data is stored, processed, and backed up in accordance with input from the CSC (and periodically thereafter, commensurate with the risk level of the third-party relationship). In cases of shared tenancy, the CSC should be allowed to request the physical location of customer data. \n \n Implementation Guidelines.\n Applicable to all service models:\n This control implementation is not service delivery model specific (IaaS, PaaS, or SaaS). Irrespective of cloud service delivery model, the CSP is responsible to define and implement, processes, procedures and technical measures for storing, processing and backing up data in accordance with the requirement specified in the contract with CSC.\n \n Recommendations to the CSP are: \n a. maintain a policy that defines the requirement to identify, classify, and record attributes for all assets (i.e., server hardware, software, data held on information systems, and information needed for disaster recovery and business continuity purposes). All assets should be tracked in an inventory system in accordance with the policy. Owner, classification, location should be identified and tracked in the asset tracking system. The inventory of assets should be reviewed at least on a quarterly basis to make sure each asset is protected in accordance with its classification, and to verify that the data inventory is accurate\n b. require the CSC to specify the particular geography where its data will be stored. The CSP should ensure that data is replicated only within a selected geographic area or region for redundancy. Data should not be replicated outside of a specified geography without first notifying the CSC, unless required by law\n c. design and architect low latency and highly available geographically dispersed storage services such as clustering, and provide replication to backup system software and data it is available with minimum loss\n d. provide services and tools to configure access, encryption, and logging features to help the CSC manage its operations effectively. The CSP should provide the CSC with the option to manage its own encryption keys\n e. not access or use customer content for any purpose other than as legally required and for maintaining the services provided to the the CSC\n f. not access any unencrypted data being transmitted, processed, or stored on the systems that run in their data centers which are geotagged. Data stored as synchronous replicas across different availability zones and regions, and the associated services, should be designed to recover quickly from availability zone and regional data failures\n g. as part of the vendor risk management program, audit its data centers yearly and review / maintain copies of attestation reports such as SOC2 Type 2",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n Applicable to all service models: \n This control implementation is not service delivery model specific (IaaS, PaaS, or SaaS). Irrespective of cloud service delivery model, the CSC is responsible for establishing a geographic location (sometimes also referred to as a “home region”) in which to initially locate its tenancy, hence data.\n \n Recommendations to the CSC are: \n a. manage access to its customer content, services and resources\n b. implement policy and processes on how its content is secured using strong encryption (in transit or at rest) provided by the CSP. If the option is available then the CSC should manage its own encryption keys\n c. Use Trusted Execution Environments (TEEs) for data in use\n d. enable logging features for incident management processes"
    }
]