[
    {
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Security Incident Management Policy and Procedures",
        "Control ID": "SEF-01",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain\n policies and procedures for Security Incident Management, E-Discovery, and Cloud\n Forensics. Review and update the policies and procedures at least annually.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This control’s ownership is \"Shared (Independent)\" as both the CSP and CSC need to independently establish their own policies and procedures for Security Incident Management. \n \n Implementation Guidelines.\n Applicable to all service models:\n The Security Incident Management, E-Discovery, and Cloud Forensics Policies and Procedures should be established and documented with clearly-defined roles and responsibilities, and for each cloud service model (IaaS, PaaS, and SaaS). Shared responsibilities should become identified with the use of Key Shared Security Responsibility Indicators (KSSRI) or Key Shared Cloud Security Responsibility Indicator (KSCSRI) where possible.\n \n Policies, procedures, and supporting systems should incorporate provisions concerning the chain of custody for forensic evidence, so that such evidence becomes legally admissible.\n \n The CSP is responsible for establishing and following company policies, resource management, regulatory and insurance requirements set forth with regards to managing incidents or performing eDiscovery and forensics-based investigations. The CSP is not responsible for maintaining knowledge of, or carrying out forensics investigations on behalf of the CSC. Nevertheless, the CSP should collaborate with the CSC during the forensic-based investigations, specifically in cases where incidents could have originated from the CSP and third-party vendors in the supply chain.\n \n The policies and procedures should include the phases of the IR life cycle and indicate when the CSP should engage the CSC for security incidents that affect the CSC, as well as the frequency at which the CSP is expected to provide updates during incidents.\n \n The CSP should communicate the Security Incident Management, E-Discovery, and Cloud Forensics Policies within the organization and may publish or share the IR policy for the CSC’s awareness.\n \n Policies should require establishing a core, qualified, and standing IR team that has the capability to assess, respond, learn, and communicate appropriately.\n \n Policies should include (but not limited to) provisions on the following:\n a. Incident Handling Process: Time-stamped recording of activities in the IR process is necessary for metrics, SLA’s, service recovery, and availability\n b. Detection:\n i. the location of the activity resulting in an incident: SaaS (e.g., api, GUI, user, data), PaaS (e.g., api, GUI, user, application, data), IaaS (e.g., api, GUI, user, application, solution stack, VM, data), or at the hypervisor, OS, compute and storage, network, or facility, and the event source logs, including which party (either the CSP or CSC) is responsible for the activity (success and/or failure) logs, as well as the availability of the logs that will be used for detection and other security incident management phases\n ii. implementation of advanced detection tools (behavioral and rule-based) with automated alerting should be used by both the CSP and CSC to provide early detection and indication of potential incidents, as well as mechanisms for end user and third-party detection of incidents to be self-reported via ticket, email, telephoning help desk, or other available channels\n c. Analysis: \n i. policy and process should follow an attack vector taxonomy process which may include referencing the Mitre ATT&CK IaaS, PaaS, and SaaS tactics and techniques. \n ii. incident scope, type, impact (functional and informational), and severity should be defined, including the data classification (e.g., personal data, Top Secret, Secret, Confidential, Health) involved in the incident\n iii. major incidents related to data breach, DDoS, malware, Data Leakage (DL), exploit types, local vs. remote, internal vs. external, perimeter, management plane incidents, and expected IR steps and consequences should be understood and demonstrated where the CSC’s cloud environment is affected\n iv. reference to consulted Incident classification and categorization techniques from organization-approved sources (e.g., US-CERT Federal Incident Notification Guidelines or FedRAMP Incident Communications Procedures). The CSC can obtain CSP support via the CSP’s Customer Incident Response Team (CIRT)\n d. Containment: \n i. the most common containment techniques (e.g., network, filtering, routing, firewall and port rule changes to deny traffic, traffic filtering or isolation) are usually the responsibility of the CSP and can be automated with capable SIEM/SOAR, logic apps, and workbooks, unless it is a CSP-provided security group firewall which would be the CSC’s responsibility\n ii. the CSP should contain the security incident by reducing or removing the attacker’s ability to continue to exploit the functionality. \n iii. the CSP should ensure that forensic evidence is not compromised and that a read-only backup or creating a snapshot should be taken (e.g., cloud block-storage snapshot)\n iv. The CSP should follow guidelines on managing the chain of custody for forensic evidence collected from affected systems, devices, cloud services, applications, and personnel. These policies, procedures, and supporting systems should result in legally admissible evidence\n e. Eradication: \n i. the responsibility for addressing the root cause and returning the environment to a safe state needs to be defined between the CSP and CSC, or indicate where it is shared (e.g., removing malware could be the responsibility of both the CSP and the CSC)\n ii. the responsibility for closing exposures, removing or resetting credentials, performing key rotation/revocation, stopping an instance, moving to a secure resource, restricting privilege access, ensuring least privilege, need to know and need to use principles should be updated accordingly\n f. Recovery:\n i. restoring from backups, depending on the backup strategy if within the same CSP or another CSP, should be indicated in the policy and follow BCP or DR plans to maintain prioritized sequential restoration and recovery of resources\n ii. Both the CSP and CSC will need to meet the changing needs of the scalable environment with adaptable RTO/RPO capabilities when resources delivering the services have expanded dynamically as with auto scaling groups, increased storage, and increased data consumption. \n iii. responsibilities for rebuilding systems and allocation of resources to achieve recovery, and for ensuring the security of the recovered environment will need to be defined between the CSP and CSC\n g. Post-Mortem: Recommend configuration changes to the environment to prevent or mitigate future incidents where the CSP and CSC agree, include lessons learned, and KPIs defined and implemented for IR processes and training\n h. Response Time Agreement: \n i. Agree on severity and response time for security incidents between the CSP and CSC where shared responsibility is agreed\n ii. Organization-approved industry standards should be consulted\n i. Communication Path with CSC: define the following prior to security incidents in the policies and procedures:\n j. Reporting path: which security incident types should be reported to the CSC\n k. Escalation path: the escalation path with the CSC prior to a security incident\n l. Notification path: automate where possible, via a security incident management tool, or an alerting service via email. An out-of-band notification path may need to be defined. The IR policy and procedures should include notification requirements and timelines as per regulatory and legal requirements, especially “Breach Notification” requirements. Reference the Federal Incident Notification Guidelines where applicable\n m. IR Plan Testing: Test the IR plan periodically, either through paper walk through/table top exercise or simulation with the participation of both the CSP and CSC as well as other relevant parties\n n. Approval: Approval requirements and senior management involvement to ensure alignment with the organization's strategic goals and risk appetite\n i. An approval process should be established for any changes or modifications to the policy and procedures\n ii. A documented record of approvals (including dates, names of approvers, and any relevant comments or discussions) should be maintained\n o. Communication: Effective communication of the policy and procedures should be facilitated to all relevant cloud stakeholders\n p. Maintenance and Reviews: Security Incident Management, E-Discovery, and Cloud Forensics policies and procedures should be documented, reviewed and updated at least annually to ensure alignment with evolving cloud security landscape and to reflect changes in cloud technology, regulations, and risks",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Service Management Policy and Procedures",
        "Control ID": "SEF-02",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain\n policies and procedures for the timely management of security incidents. Review\n and update the policies and procedures at least annually.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This control’s ownership is \"Shared (Independent)\" as the CSP and CSC independently establish their own policies and procedures for Security Incident Management. The policies and procedures should clearly define roles and responsibilities and any shared responsibilities with the use of KSSRIs or KSCSRIs throughout all phases of the Security Incident Management process, including chain of custody for forensic evidence and legal obligations between the CSP and CSC.\n \n Implementation Guidelines.\n Applicable to all service models:\n Policies should include (but not limited to) provisions on the following: \n a. CSP-CSC Collaboration: Address personnel designated to report incidents between the CSP and CSC, the timeframes established, and agreed-upon impact and severity rating applicable to the CSC and CSP for incident management practices. This ensures that an incident categorized by the CSP or CSC does not negate or dictate the appropriate response to contain and eradicate the incident, or cause variations in the understanding of the appropriate response from either party (e.g., a personal data breach requires shorter response time than a DDoS attack), the frequency to provide reports throughout the incident lifecycle, and how the incident should be reported\n b. Roles and Responsibilities: Clear roles and responsibilities of the personnel in the entire incident and event management lifecycle should be defined\n c. Proactive Measures: aim to reduce IR time by including preventative measures following a defense-in-depth strategy, least privilege, need-to-know, need-to-use, and zero trust models where possible, as some defense mechanisms will be available from the CSP as part of the service or at a cost to the CSC\n d. IR Automation SOAR: address automation with a Security Orchestration and Automation Response (SOAR) solution to reduce the time to alert, contain, remediate, and eradicate the incident automatically, (e.g., when a malware attack is detected, quarantine the impacted systems, then either clean them automatically, reimage them, or perform other activities as programmed in the SOAR). The CSP will need to define what automated responses can be provided to the CSC where SOAR technology is used\n e. IR Containment: define roles between the CSC and CSP for containment strategy. Also, predetermined criteria informing how to contain the incident should be defined in the procedures to ensure timely and cost effective containment and management. Use of KSCSRIs may assist with ensuring CSP and CSC have awareness of their containment responsibilities\n f. Evidence Cloud Storage: consider the use of either a separate cloud account or of another CSP for storage of evidence. The CSP will need to inform the CSC how to accomplish this\n g. Approval: Approval requirements and senior management involvement to ensure alignment with the organization's strategic goals and risk appetite\n i. An approval process should be established for any changes or modifications to the policy and procedures\n ii. A documented record of approvals (including dates, names of approvers, and any relevant comments or discussions) should be maintained\n h. Communication: Effective communication of the policy and procedures should be facilitated to all relevant cloud stakeholders\n i. Maintenance and Reviews: Policies and procedures for the management of security incidents should be documented, reviewed and updated at least annually to ensure alignment with evolving cloud security landscape and to reflect changes in cloud technology, regulations, and risks\n \n Other policy and procedural considerations for timely management of security incidents for both CSP and CSC should include agreements on:\n a. IR Alerting: alerting procedures should be defined and implemented within a defined time frame based on event, severity, impact, and threat intelligence\n b. IR Time: response time depending on incident severity (e.g., number of minutes/hours per severity level) as per contractual agreement or SLA\n c. investigation of the time and date (including time zone) of each occurrence of evidence handling, the shared responsibility to produce (through secure auditing, logging, and monitoring), collect, safely store (with encryption and integrity), and transfer information or evidence related to the incident. Use of KSCSRIs may be used to assist with identifying when responsibility changes between the CSP and CSC and vice versa if another CSP will be used to store the evidence\n d. RTO Metrics: recovery time frame based on RTO and SLAs. Use of KSCSRIs may assist with meeting these required time frames \n e. IR Records: chronological record of all activities during the incident lifecycle with indicators to notify, report, and communicate as per agreed time frames between the CSP and CSC\n \n The CSP should communicate the Security Incident Management, E-Discovery, & Cloud Forensics, Service Management Policy and Procedures within the organization and may publish or share the Incident Response Policy with the CSC for awareness.",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Incident Response Plans",
        "Control ID": "SEF-03",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain\n a security incident response plan, which includes but is not limited to: relevant\n internal departments, impacted CSCs, and other business critical relationships\n (such as supply-chain) that may be impacted.'",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n Incident Response Plans control ownership is \"Shared (Independent)\" as both the CSP and CSC need to independently establish their own security IR plan and own the responsibility. The IR plans should clearly define roles and responsibilities and any shared responsibilities with the use of KSSRIs or KSCSRIs where possible.\n \n Implementation Guidelines.\n Applicable to all service models:\n The IR plan relates back to the SEF-01 implementation guidelines to ensure that corresponding policy and procedure requirements are incorporated for all phases of the IR life cycle.\n \n The IR plan should provide a methodology that enables efficient management of security incidents for the organization’s cloud products and services (SaaS, PaaS, IaaS) and clearly defines the relied-upon CSP’s services to achieve a coordinated response. Once the IR plan is established and documented the plan needs to be approved and communicated.\n \n The IR plan should include the following provisions:\n a. Scope: The IR plan should apply to both internal dependencies (such as IT, operations, support, and legal) and external dependencies (suppliers, vendors, partners, customers, and other third parties). The cloud services, systems, applications, users, and data that are in scope and monitored for events and incidents. Ensure the scope network and infrastructure is monitored by the CSP\n b. Incident Response Team and Stakeholders: The stakeholders include customers, law enforcement who receive information about incidents and/or can be involved in incident management\n c. Incident Tracking and Classification: Define the issue and tracking system used for recording the incident. Classify incidents by severity and urgency (e.g., High, Medium, Low, Major vs Minor), using threat intelligence, attack vector taxonomy Mitre ATT&CK for PaaS, IaaS, and SaaS tactics and techniques, and data classification for any data involved, the scope, and the impact of the incident.\n d. Response Type and Expected Response Timeframes: The plan should indicate when a manual vs. automated response is required by the CSP or CSC, the time frames to respond by (e.g., mean time to acknowledge aka MTTA), by when the CSP or CSC is required to report an incident, who is responsible for containment of the incident, and the average expected mean time to containment (MTTC). The response may invoke subsequent IR plans such as an encryption key compromise-recovery plan for restoring cryptographic security services\n e. Evidence Gathering and Handling: Steps to collect and maintain the integrity of the evidence should be provided, when and where to make copies, when to use exact replicas for analysis, the CSP’s or CSC’s responsibilities around logs, other collected evidence, storing in restricted read-only repositories, using a separate account or another CSP, hashing procedures, and chain of custody for ensuring admissibility in legal proceedings\n f. Incident Lifecycle Phases and Procedures: Procedures for preparation, detection and analysis, eradication and recovery, post-mortem with continuous analysis at each phase to determine effectiveness, the CSC’s preventative measures such as IDS/IPS, and provide specificity around incidents with shared responsibilities.\n g. Roles and Responsibilities: Common shared security responsibilities between the CSP and CSC in relation to incident response:\n i. Client and endpoint incidents – (SaaS) shared CSC and CSP\n ii. Identity and access incidents – (PaaS, SaaS) shared CSC and CSP\n iii. Application Incidents – (PaaS) shared CSC and CSP\n iv. Network incidents – (IaaS) shared CSC and CSP\n v. Host incidents – (IaaS) shared CSC and CSP\n Common non-shared responsibilities:\n vi. Data classification and accountability incident – CSC\n vii. Client and endpoint incidents (IaaS, PaaS) – CSC\n viii. Identity and access incidents (IaaS) – CSC\n ix. Application incidents (IaaS) – CSC\n x. Application incidents (SaaS) – CSP\n xi. Network incidents (PaaS, SaaS) – CSP\n xii. Host incidents (PaaS, SaaS) - CSP\n xiii. Infrastructure incidents (IaaS, PaaS, SaaS) - CSP\n h. Notification and Reporting: List of personnel at the CSP and CSC, third-party personnel, and distribution lists for notification. Use internal and external websites or portals where incidents and service outage information can be published and updated regularly to advise on the status of incidents that affect major services. US-CERT (required for US federal agencies and systems operated on behalf of the federal government) serves as the federal incident response center\n i. Business Impact Assessment Information: The CSP and CSC should have BIA information for each asset, system, application, and associated classified data, with owners identified and the relevant internal departments, upstream/downstream interdependencies, services (IaaS, PaaS, SaaS), and other business-critical relationships (such as supply chain) that may be impacted\n j. Reference Information: Information on how to determine the applicable RPO, RTO, and MTD of a particular system or set of systems for restore from backup recovery procedures to restore affected services, logs, and data as per agreements between the CSC and CSP to maintain business continuity. Outline the criteria required to select the appropriate eradication and recovery choice, e.g., restore, rebuild, replace, redirect or remove.\n k. Schedule: A schedule to review, test, evaluate, and maintain and approve the plan. Define the frequency or schedule to conduct the review, test coordination, and approve the plan. \n l. Plan Testing: Conduct a paper walk through/table top exercise or simulation where feasible with the participation of both the CSP and CSC as defined in the schedule. Evaluate and maintain/update the plan accordingly:\n i. after testing the plan and with lessons learned obtained\n ii. after incidents that resulted in changes to the response methodology, e.g., new attack vectors, containment strategies, false positives, false negatives, or caused a deviation from the response plan, and exposures detected from penetration testing.\n iii. Timing: When services (IaaS, PaaS, SaaS), critical assets, applications, and classified data are either added or removed\n iv. Plan Reapproval: The plan should be reapproved after all necessary changes are made\n v. Change Control: The IR plan should maintain a document control section indicating when the plan was tested and the changes to the plan content with each iteration",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Incident Response Testing",
        "Control ID": "SEF-04",
        "Control Specification": "Test and update as necessary incident response plans at planned intervals\n or upon significant organizational or environmental changes for effectiveness.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n The control’s ownership is \"Shared (Independent)\" as both the CSP and CSC need to independently test and update their individual organization’s IR plan.\n \n Implementation Guidelines.\n Applicable to all service models:\n Incident Response plans should be tested periodically either through paper walk through/table top exercise or simulation where feasible with the participation of both CSP and CSC to verify the IRP’s effectiveness using various event scenarios.\n \n The CSP should: \n a. validate and update all contact information and IR team members\n b. validate and update the scope of the IR plan, both internal dependencies (such as IT, operations, support, and legal) and external (suppliers, vendors, partners, customers, and other third parties). The cloud services, systems, applications, users and data that are in scope and monitored for events and incidents. Ensure the scoped network and infrastructure is monitored by the CSP\n c. define the scope for the IR test (e.g., an environment for the IR plan testing should include the following options, but not be limited to: a duplicate test/simulation environment, an alternate non production environment, and a third party CSP cloud service/account)\n d. decide which area in the threat landscape to test the IR plan with e.g., the tactics techniques procedures (initial access, execution, persistence, privilege escalation, defense evasion, credential access, discovery, lateral movement). Follow an attack vector taxonomy process using the Mitre ATT&CK for IaaS, PaaS, SaaS tactics and techniques to simulate events and activities that would result in an incident\n e. schedule the IR plan test – arrange meetings with participants, the CSP, and the CSC as defined in the plan\n f. conduct the paper walk through or simulation following the IR plan and all phases of the incident. Maintain a chronological log of the testing activities for metrics and indicators of successfully completing all timed activities and steps outlined in the plan\n g. coordinated test, review, and update manual processes and automated incident management features, detection, alerting, playbooks, logic apps, rules, containment, eradication and recovery strategies\n h. reconcile the organization's BC and DR plans with the IR plan, and address discrepancies\n i. document and communicate the IR plan test results, with resulting action items that address areas that failed during the test, deviated from the response methodology, containment strategies, false positives, false negatives, or could not be executed\n j. update the plan to address discrepancies and failures, and obtain reapproval of the plan\n \n The CSP and CSC should also test, update, and improve IR plans after:\n a. significant organizational changes\n b. external supply chain disruptions and natural disasters\n c. security attacks, particularly those resulting in security breaches",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Incident Response Metrics",
        "Control ID": "SEF-05",
        "Control Specification": "Establish and monitor information security incident metrics.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a shared responsibility between the CSP and the CSC to ensure that appropriate security incident metrics are established and monitored. \n \n Implementation Guidelines.\n Applicable to all service models:\n Security metrics need to be established, monitored and analyzed to detect weaknesses in operational processes or technical controls to support effective incident management.\n \n The CSP should define, implement and monitor security incident metrics related to:\n a. all supporting infrastructure — virtual elastic compute, server operating systems, storage, and networking\n b. middleware, development tools, BI services, and database management systems\n c. applications configured as contractually agreed with the CSC\n \n Implementation best practices for establishing and monitoring security incident metrics include (but not limited to):\n a. Detection Metrics: \n i. Time to Identify (TTI) metric measures the average time to identify an incident\n ii. False positives metric tracks the percentage of alerts that weren't actual incidents \n b. Response Metrics:\n i. Time to Contain (TTC) metric measures the average time to isolate and prevent further damage\n ii. Mean Time to Respond (MTTR) metric tracks the average time to respond and fully resolve an incident\n c. Recovery Metrics:\n i. Data Recovery Time (DRT) measures the average time to restore affected systems and data (e.g., downtime due to incident)\n ii. Downtime Cost metric tracks the financial impact of service disruptions due to incidents\n d. Quantify Security Events: \n i. Number of security alerts metric that tracks the volume of alerts generated by security tools\n ii. Incident volume metric monitors the volume of the events monitored and the ratio of those events to incidents\n e. Business Impact:\n i. Downtime metric tracks the duration of service disruptions due to security incidents\n ii. Data Loss metric measures the volume of data compromised during an incident\n f. Incident Metrics in SLAs: Outline security incident metrics baselines and goals within SLAs to ensure transparency and accountability towards CSCs\n g. Metrics Prioritization: Focus should be on metrics for business continuity and CSC impact (e.g., MTTR for critical systems)\n h. Monitoring Incident Metrics: \n i. SIEM solutions should be leveraged to collect, analyze, and visualize security data and provide real-time insights into potential incidents\n ii. SIEM solutions should be configured to trigger automated alerts for suspicious activities based on predefined thresholds for chosen metrics\n i. Incident Metrics Review: \n i. Security incident metrics should be regularly reviewed to identify areas for improvement and updated based on lessons learned from incidents and evolving threats\n i. Metrics should be compared against industry standards and other CSPs (when possible) to identify areas for improvement",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n Applicable to all service models:\n The implementation guidelines provided for the CSP apply.\n \n In addition, the CSC should define, implement, and monitor security incident metrics related to staff access to applications as contractually agreed with the CSP."
    },
    {
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Event Triage Processes",
        "Control ID": "SEF-06",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures supporting business processes to triage security-related events.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n The implementation responsibility between the CSP and the CSC is typically both shared and dependent, as collaboration is necessary for effective triage of a security event. Triage is used for identifying, evaluating, prioritizing and responding to security events (and potential incidents) that impact both parties. The CSP can provide valuable insights into potential sources or root causes of the security event, while the CSC can contribute information specific to their data, configuration, applications, and user activity. This joint effort helps to identify the event’s scope and potential impact, leading to a more targeted and efficient response. \n \n For example, a security incident occurring in the platform layer for an IaaS infrastructure should be driven jointly by the CSC and the CSP to determine if it originated in the CSC’s environment or the CSP’s environment.\n This may involve containment measures implemented by the CSP, such as isolating affected resources, while the CSC can take steps like user account suspension or data recovery, depending on the specific event.\n \n Implementation Guidelines.\n Applicable to all service models:\n A fully documented and annually reviewed and approved triage management process should be in operation to ensure that all security events are investigated and evaluated in a timely manner.\n \n The CSP should perform a triage process for all supporting infrastructure — virtual elastic compute, server operating systems, storage, and networking — but also middleware, development tools, BI services, database management systems, and applications configured for use by the CSC. The CSP should have visibility into the triage process to ensure the security incident management process is followed as contractually agreed.\n \n Implementation best practices for security events triaging include (but not limited to):\n a. Stakeholders Collaboration: \n i. Roles and responsibilities should be established for internal security teams, CSC support, and any external partners involved in incident response, as per contractual agreements\n ii. A communication plan should be established for notifying relevant stakeholders, including internal teams, impacted CSCs, and regulatory bodies (if necessary)\n b. Events Classification Scheme: A standardized method for classifying security events based on severity, potential impact, and urgency should be defined, to support events prioritization. A multi-tiered approach can be considered:\n i. Tier 1.Low-risk events might involve automated containment and basic investigation (e.g., suspicious login attempts)\n ii. Tier 2.Medium-risk events require deeper investigation and potential CSC notification (e.g., potential malware infection)\n iii. Tier 3.High-risk events necessitate immediate action, full investigation, and potential regulatory reporting (e.g., confirmed data breach)\n c. Standardized Playbook: A documented playbook outlining steps for each tier, should be developed, including:\n i. Procedures for an initial assessment and gathering initial details about the event, including source, timeframe, and potential indicators of compromise (IOCs)\n ii. Measures should be implemented for containment and to prevent further damage (e.g., isolating compromised systems or limiting user access)\n iii. A thorough investigation should be conducted to determine the root cause, scope of the incident, and potential data loss (e.g., log analysis, threat intelligence feeds, and security tools)\n iv. Actions should be implemented to eradicate the threat, recover affected systems, and prevent future occurrences",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The CSC responsibilities include promptly reporting any suspicious activity to the CSP and collaborating with the CSP to evaluate, prioritize and respond to security events (and potential incidents), as per contractual agreement.\n \n Implementation Guidelines.\n Applicable to all service models:\n The implementation guidelines provided for the CSP apply.\n \n In addition, the CSC should adhere to the following best practice:\n a. Incident Collaboration as per CSP Contractual Agreements: \n i. Contractual agreements with the CSP should clearly define the responsibilities and response timelines in case of a security incident\n ii. The communication protocols outlined in the contractual agreement with the CSP for reporting security incidents to the CSP should be well understood\n iii. A communication channel should be established with the CSP to share relevant information regarding security incidents promptly\n iv. The CSC should have visibility into the CSP triage process to ensure the security incident management process is followed as contractually agreed\n v. Guidance and assistance from the CSP's security team is encouraged in defining and implementing CSC’s triage process"
    },
    {
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Security Breach Notification",
        "Control ID": "SEF-07",
        "Control Specification": "Define and implement, processes, procedures and technical measures\n for security breach notifications. Report security breaches and assumed security\n breaches including any relevant supply chain breaches, as per applicable SLAs,\n laws and regulations.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is “Shared (Independent)” since both CSP and CSC are responsible for ensuring that security breach notifications are disclosed according to the local legal and regulatory requirements as stated in the services agreement. The controls however are Independent from one another. Both entities may require different processes, procedures, and technical controls.\n \n Implementation Guidelines.\n Applicable to all service models:\n The CSP should implement a process and procedures to report security breaches and assumed security breaches for all supporting infrastructure — virtual elastic compute, server operating systems, storage, and networking — and also middleware, development tools, BI services, database management systems, and applications configured as contractually agreed for use by the CSC.\n \n Implementation best practices for security breach notifications include (but not limited to):\n a. Breach Notification Plan: \n i. What constitutes a security breach, and the types of incidents requiring notification (unauthorized access attempts, data exfiltration) should be defined \n ii. Breach information should be included in breach notifications and specify the nature of the breach, affected data types, potential risks, and mitigation steps taken\n iii. Procedures for notifying relevant parties should be defined including impacted CSCs, regulatory bodies, and internal stakeholders, as per SLAs and relevant regulations\n iv. Timeframes for notifying impacted parties based on the severity of the breach and relevant regulations should be defined (e.g., 72 hours as mandated by some data breach laws)\n b. Supply Chain Breach Notification:\n i. Vendor contracts should include provisions requiring notification of security incidents impacting the CSPs' services\n ii. Breach notification procedures should adhere to data protection regulations\n c. Breach Notification Channels: Appropriate communication channels for notifying affected parties about security breaches should be established",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Security Incident Management, E-Discovery, & Cloud Forensics",
        "Control Title": "Points of Contact Maintenance",
        "Control ID": "SEF-08",
        "Control Specification": "Maintain points of contact for applicable regulation authorities,\n national and local law enforcement, and other legal jurisdictional authorities.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This control is “Shared (Independent)” since both the CSP and CSC are responsible for the maintenance and documentation of points of contact for applicable regulation authorities, national and local law enforcement, and other legal jurisdictional authorities. \n \n Implementation Guidelines.\n Applicable to all service models:\n The CSP should document and maintain security incident contact information with relevant authorities and implement a communication process, and assign responsibilities to the communications team (personnel authorized to send notifications) and external regulatory entities, to prepare them for investigations requiring engagement with law enforcement.\n \n Implementation best practices for maintaining points of contact include (but not limited to):\n a. Authorities Identification:\n i. The relevant regulatory bodies should be searched for and identified in each region where the CSP operates (e.g., financial regulators, data protection authorities).\n ii. Points of contact should be established within national and local law enforcement agencies in operational regions\n iii. Legal jurisdictions should be identified where CSC data might be stored or processed due to international operations.\n b. Centralized Contact Repository:\n i. A secure repository should be developed containing contact information for all identified authorities (e.g., names, titles, phone numbers, email addresses, jurisdiction areas, and preferred communication methods)\n ii. The repository should be updated at least annually and upon any changes in personnel or contact information within the included authorities\n c. Communication Channels:\n i. Communication protocols for each authority type should be established (e.g., secure email for regulatory bodies, dedicated hotlines for law enforcement)\n ii. A process should be implemented for verifying the legitimacy of any communication received from claiming authorities\n d. Legal Counsel: Legal counsel should be considered to ensure proper procedures and data sharing protocols are followed when interacting with authorities",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP applies.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    }
]