{
  "metaData": {
    "name": "Digital Operational Resilience Act (DORA)",
    "itemType": "Acts and Regulations",
    "locality": "European Union",
    "description": "The EU Digital Operational Resilience Act (DORA) aims to strengthen the cybersecurity and operational resilience of financial institutions within the European Union. It establishes a unified regulatory framework requiring financial entities to ensure they can withstand, respond to, and recover from all types of information and communication technology (ICT) disruptions and threats. DORA mandates comprehensive risk management practices, continuous monitoring, and incident reporting, ensuring financial stability and consumer protection across the EU.",
    "relationToCloudSecurity": "The EU Digital Operational Resilience Act (DORA) specifically addresses the role of cloud computing in financial institutions by emphasizing the need for robust security measures when using third-party ICT services, including cloud providers. DORA mandates stringent oversight and risk management practices for outsourcing arrangements, requiring financial entities to assess the security and resilience of cloud services, ensure continuous monitoring, and have clear contingency plans. The act also requires institutions to establish contractual safeguards with cloud providers to ensure compliance and operational continuity, emphasizing the criticality of secure and resilient cloud computing in the financial sector.",
    "relationToAISecurity": "The EU Digital Operational Resilience Act (DORA) intersects with AI by emphasizing the need for secure and resilient deployment of AI systems used in financial institutions. DORA highlights the importance of managing risks associated with AI technologies, particularly in the areas of data integrity, algorithmic transparency, and the potential impact of AI-driven decisions on operational stability. Financial entities are required to include AI in their ICT risk management frameworks, ensuring that AI systems are robust, secure, and compliant with regulatory standards, especially when integrated with critical financial services."
  },
  "links": {
    "wikipedia": "https://en.wikipedia.org/wiki/Digital_Operational_Resilience_Act",
    "source": "https://eur-lex.europa.eu/eli/reg/2022/2554/oj",
    "textUsed": "https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=CELEX:32022R2554",
    "csaLocation": "https://github.com/CloudSecurityAlliance-DataSets/dataset-public-laws-regulations-standards/tree/main/country/EU/EU-DORA-ACT"
  },
  "conversionProcess": [
    "html2md",
    "cleanup",
    "conversion to CSV",
    "cleanup"
  ],
  "fileFormatNotes": "Typical EU act, Chapter, Section, Article",
  "fileDataRemovalNotes": [
    {
      "name": "chapterIX",
      "notes": "CHAPTER IX - FINAL PROVISIONS: Removed, not applicable to mappings"
    }
  ],
  "files": {
    "downloadedFile": "eu-dora-act.html",
    "markdownFileFull": "",
    "markdownFileProcessed": "eu-dora-act-processed.md",
    "csvFile": "eu-dora-act.csv",
    "jsonFile": "eu-dora-act.json"
  }
}
