[
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Encryption and Key Management Policy and Procedures",
        "Control ID": "CEK-01",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain\n policies and procedures for Cryptography, Encryption and Key Management. Review\n and update the policies and procedures at least annually.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a “Shared (Independent)” responsibility between the CSP and the CSC as the creation of a Cryptography, Encryption and Key Management policy by each party is essential for effective security. The CSP should offer cryptography services, and in such a case it is responsible for the infrastructure that supports these services. The CSC, on the other hand, is responsible for correctly using these services to secure their data, for instance, choosing when and what data to encrypt, and managing access to encryption keys.\n \n Implementation Guidelines.\n The CSP should have a robust system for cryptographic management with clear policies and procedures for encryption and key management, including key generation, distribution, rotation, revocation, destruction, activation, suspension, deactivation, archival, compromise, recovery, inventory management, purposes, and access. These policies should be reviewed and updated at least annually.\n \n IaaS Provider:\n Policies and procedures should be in place that dictate how and when these encryption methods are to be used, who has access to the keys, how the lifecycle of these keys is managed, roles and responsibilities, data protection, change management, risk management, monitoring, reporting, incident handling, and audit. An IaaS provider should offer mechanisms for encryption both in transit and at rest for all data, along with a key management service. The CSP should ensure that these services comply with the latest security standards and best practices.\n \n PaaS Provider:\n Policies and procedures should be in place to guide the usage and management of these encryption methods and keys, including change management and risk management practices. A PaaS provider should offer platform-level encryption for data at rest and in transit, including a secure key management system. The CSP should adhere to security best practices and standards, including data protection protocols like data encryption and algorithm selection.\n \n SaaS Provider:\n Policies and procedures should be in place that dictate how encryption is handled at the application level, including key management, again featuring the full spectrum of key management activities. The provider should ensure all data at rest and in transit is encrypted using approved cryptographic protection methods. The CSP should offer the CSC the ability to manage their own keys where feasible and monitor the technology closely to keep up with emergence of threats and vulnerabilities. The CSP should ensure incident handling procedures, audit mechanisms, and activity logging for encryption and key management processes.\n \n Policies should include (but not limited to) provisions on the following:\n a. Scope and Objectives:\n i. Scope definition and governance of the organization's use of cryptography, encryption, and key management practices to protect sensitive data\n ii. Objectives for the secure implementation of cryptographic controls for data security and the establishment of key management practices to safeguard encryption keys from unauthorized access, modification, or disclosure\n b. Roles and Responsibilities: Responsibilities of all entities involved in managing cryptographic controls and the encryption key lifecycle. This includes responsibilities for generating, distributing, storing, rotating, and disposing of keys\n c. Encryption Standards: Cryptographic data security and protection requirements, for both data in transit and at rest and covering the necessary encryption standards, algorithms and best practices\n d. Cryptography Change Management: Procedures for making changes to cryptographic controls and encryption key management, including who can authorize changes, how changes should be documented, and processes for testing and auditing changes\n e. Risk Management: Procedures for identification, assessment, and mitigation of risks associated with cryptographic controls and key management that should be integrated into the CSP’s broader risk management framework\n f. Key Management Activities: Requirements regarding key management activities, including key generation, distribution, rotation, revocation, destruction, activation, suspension, deactivation, archival, compromise, recovery, inventory management, purposes, and access\n g. Monitoring and Reporting: Monitoring of cryptographic controls and key management practices, along with regular reporting of their status, including any anomalies or potential breaches to the CSC\n h. Approval: Approval requirements and senior management involvement to ensure alignment with the organization's strategic goals and risk appetite\n i. An approval process should be established for any changes or modifications to the policy and procedures\n ii. A documented record of approvals (including dates, names of approvers, and any relevant comments or discussions) should be maintained\n i. Communication: Effective communication of the policy and procedures should be facilitated to all relevant cloud stakeholders\n j. Maintenance and Reviews: Cryptography, Encryption, and Key Management policies and procedures should be documented, reviewed and updated at least annually to ensure alignment with evolving cloud security landscape and to reflect changes in cloud technology, regulations, and risks",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale already provided for the CSP applies.\n \n Implementation Guidelines.\n IaaS Customer: \n The CSC should consider including in policy provisions for managing the encryption of their data within the infrastructure provided by the CSP. The CSC should use the tools and resources provided by the CSP for key management, following best practices.\n \n PaaS Customer: \n The CSC should create a policy that ensures how they use the secure platform provided by the CSP effectively, including using the encryption provided at the platform level. The CSC policy includes additional encryption within the platform, depending on CSC’s needs and the services provided by the CSP. \n \n SaaS Customer: \n The CSC should create a policy that ensures how they use the secure software service provided by the CSP effectively, including using the encryption provided at the software level. The CSC should work with the CSP to understand how keys are managed within the software service and ensure it meets their needs and compliance requirements. \n \n Policies should include (but not limited to) provisions on the following:\n The policies provided for the CSP apply."
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "CEK Roles and Responsibilities",
        "Control ID": "CEK-02",
        "Control Specification": "Define and implement cryptographic, encryption and key management\n roles and responsibilities.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a “Shared (Independent)” responsibility between the CSP and CSC, because the CSP is responsible for defining and implementing roles and responsibilities for cryptographic operations and key management inside their organization. In order to correspond with the CSC's individual security demands, the CSP is expected to provide configurable options related to these duties. However, the CSP has no control over how the CSC manages the options presented, making the role 'independent'. Depending on the tools and features provided, the CSP might influence the CSC's roles and responsibilities, in particular with service models such as SaaS.\n \n Implementation Guidelines.\n IaaS Provider:\n a. define and enforce roles and responsibilities around key managers, ensuring they cannot access protected data or the cryptographic engine. Also, provide the CSC with robust access controls and role definition capabilities within their platform. This includes enabling the CSC to implement the principles of SoD and split knowledge\n b. incorporate practices like SoD, splitting knowledge, and least privilege access to cryptographic resources and processes\n c. establish clear policies for the management of both operational and backed-up key information storage and recovery. Assist customers in defining cryptoperiods, overseeing key and digital certificate inventories, and verifying the integrity of stored key information prior to use. Manage the process of revoking compromised keys and creating replacement keys or digital certificates. Maintain transparency throughout these processes\n d. offer secure solutions for key storage and management, including secure distribution of private and secret keys and the metadata, and provide customers with the ability to securely generate, revoke, and destroy their cryptographic keys\n \n PaaS Provider:\n a. define roles and responsibilities for the key management system, including a policy authority responsible for all operational CKMS roles, and reports to IT executives\n b. manage the encryption and key management at the platform level, securing the runtime environment to prevent unauthorized access to cryptographic keys and protecting keys in use\n c. ensure that policies are in place for storage and recovery of archived key information and integrity checks of stored key information.\n d. offer encryption solutions at the data, application, and transaction layers, and support the CSC in implementing their own encryption solutions if required\n \n SaaS Provider:\n a. define roles and responsibilities across the full stack, including who can set and change encryption configurations for the software or application\n b. implement robust encryption and key management practices for the CSC data at rest, in transit, and in use, providing it with transparency about these practices\n c. offer options for the CSC to manage its own encryption keys where possible (e.g., bring-your-own-key-scenarios, aka BYOK), and support the CSC in the secure implementation of these options\n d. establish the rules for the management of the storage and recovery of operational and backed-up key information.\n \n Applicable to all service models:\n a. define and follow key lifecycle responsibilities, including key generation, distribution, cryptoperiod establishment, key revocation, storage and recovery, integrity checks, and destruction of keys when they are no longer required\n b. conduct regular audits and reviews to ensure compliance and check the effectiveness of segregation of duties, roles, and responsibilities",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership for the CSC is also “Shared (Independent”). This results from the CSC's need to identify and implement roles and responsibilities to appropriately utilize and manage the CSP's cryptographic operations and key management options. While the CSP provides the essential tools and options, it is the responsibility of the CSC to develop roles and operational procedures that are appropriate for its specific needs and operational context. In certain service models, such as SaaS, the CSC's role may be shaped by the CSP's options and tools, but the primary responsibility for defining and implementing roles and responsibilities remains with the CSC.\n \n Implementation Guidelines.\n IaaS Customer:\n a. establish clearly defined roles and responsibilities for cryptographic key management within its systems. This includes duties like managing its own keys at the virtual machine and application levels if using CMKs\n b. define duties to effectively leverage the access controls and role definition capabilities provided by the CSP, aiming for proper implementation of SoD and split knowledge principles\n c. define responsibilities for secure cryptographic key operations - generation, distribution, revocation, and destruction\n d. define tasks to engage with the CSP for secure distribution of keys, effective inventory management of keys and digital certificates, and establishing mechanisms to revoke and replace compromised keys\n e. if using CMKs, define responsibilities like generating, rotating, and managing its own keys at the virtual machine and application levels\n f. perform regular integrity checks of stored key information\n \n PaaS Customer:\n a. establish roles and responsibilities for encryption and key management at the application level\n b. assign responsibilities to leverage CSP-provided solutions and to implement additional security measures as required to protect keys in use. This may include using Hardware Security Module (HSM), KMS, secret management, or secure methods for key storage and usage\n c. define responsibility to use the provided logging and monitoring capabilities by the CSP to promptly detect and respond to any key compromise incidents\n d. define responsibility to engage with the CSP to understand platform-level security measures and ensure that its application-level encryption and key management requirements are met\n e. if using CMKs, define the responsibilities like generating, rotating, and managing its own keys at the application levels\n \n SaaS Customer:\n a. ensure understanding and agreement with the CSP's encryption and key management practices for customer data at rest, in transit, and in use\n b. if the option is available, consider the role of managing its own encryption keys (e.g., BYOK). This includes generating, rotating, and managing its own keys for use with the SaaS application\n c. delegate the duty of validating that the CSP has clearly defined and separated key management roles to prevent unauthorized access or changes to keys\n \n Applicable to all service models:\n a. define and follow key lifecycle responsibilities, including key generation, distribution, cryptoperiod establishment, key revocation, storage and recovery, integrity checks, and destruction of keys when they are no longer required\n b. conduct regular audits and reviews to ensure compliance and check the effectiveness of segregation of duties, roles, and responsibilities"
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Data Encryption",
        "Control ID": "CEK-03",
        "Control Specification": "Provide cryptographic protection to data at-rest and in-transit,\n using cryptographic libraries certified to approved standards.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n In the context of the service delivery models, IaaS, PaaS, and SaaS, the CSP has the primary responsibility of managing and providing cryptographic protection for data at rest and in transit, using certified cryptographic libraries, but the control's implementation is also dependent on the CSC, making it a shared but dependent responsibility. \n \n Implementation Guidelines.\n This measure enhances the security posture by safeguarding sensitive information from unauthorized access during storage and transmission. Using cryptographic libraries certified to approved standards adds an extra layer of assurance, meeting industry benchmarks for encryption, and instilling confidence in both the CSP and CSCs regarding the confidentiality and integrity of their data.\n \n IaaS Provider:\n a. CSP should maintain a secure CKMS that meets or exceeds FIPS validation or approval by other relevant international standardization bodies\n b. offer mechanisms for full disk encryption options for at-rest databases and file servers and encryption for in-transit (network) data, providing the CSC the ability to implement as needed\n c. provide secure network communication protocols, such as TLS, to protect in-transit data between virtual machines, CSP services and users \n d. maintain security of the underlying infrastructure supporting these cryptographic services\n e. offer mechanisms for keeping data encryption keys in a protected environment, safe from exfiltration and tampering, including tampering by the CSP\n \n PaaS Provider:\n a. In addition to the responsibilities listed for IaaS, the CSP should offer platform-level encryption options for at-rest, in use and in-transit data. This should include options to encrypt various data structures/types (e.g., files, records, or fields) \n b. offer the CSC the ability to manage its encryption settings, including the selection of encryption algorithms where appropriate \n \n SaaS Provider: \n a. beyond the responsibilities listed for IaaS and PaaS, ensure that customer data is encrypted both at rest and in transit \n b. ensure that end user workstations and interfaces are secured using encryption for at-rest and in-transit data\n c. offer options for end-to-end encryption, where data remains encrypted from the point of origin to the point of use \n d. offer options for end-to-end encryption, like trusted execution environments, where the data remains encrypted while in-use\n e. manage encryption keys securely, ensuring they are regularly rotated and not exposed to unauthorized parties. Also, the CSP should provide secure methods for the CSC to manage encryption keys within the software service, including generation, rotation, and revocation of keys",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership for the encryption of both at-rest and in-transit data is shared with a dependency between the CSP and CSC. While the CSP provides the cryptographic tools and libraries, the CSC is responsible for correctly implementing and using these tools to ensure the appropriate level of data protection.\n \n Implementation Guidelines.\n From the CSC perspective, the cryptographic protection of data at-rest and in-transit using certified libraries ensures the confidentiality and integrity of their sensitive information within the cloud environment. This control provides reassurance to CSCs in the security measures implemented by the CSP and safeguarding their data against potential security threats.\n \n IaaS Customer: \n a. ensure that data in storage & in transit, use of Trusted Execution Environments (TEEs) for data in use, including databases and files, are encrypted. This may involve selecting the appropriate level of encryption, enabling full disk encryption, encrypting specific data structures, using encryption for sensitive data, and managing encryption keys\n b. ensure that in transit data is encrypted, including across system interfaces, public networks, and electronic messaging (e.g., email, video, voice). Secure network communication protocols, such as TLS, with strong industry accepted ciphers\n c. manage encryption keys securely, including their secure generation, distribution, rotation, revocation, and destruction\n d. Mechanisms should be utilized for keeping data encryption keys in a protected environment, like trusted execution environments, safe from exfiltration and tampering, including by the CSP staff\n \n PaaS Customer: \n a. Apart from what is mentioned in IaaS, work with the CSP to understand the platform-level encryption options, and configure them appropriately, like database encryption features to secure data within databases \n b. manage application-level encryption keys securely, using the methods provided by the CSP, that prevent access to the keys by the CSP\n c. leverage the provided APIs or SDKs to implement encryption within applications \n \n SaaS Customer: \n a. identify and classify its data to determine what needs to be encrypted \n b. ensure that encryption is enabled and properly configured for both at-rest and in transit data. As per business requirement, this can include end-to-end encryption where appropriate. The CKMS service can be utilized for efficient management \n c. if the CSP allows for CSC-managed keys, ensure to implement secure key management practices. This includes secure key generation, rotation, and revocation"
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Encryption Algorithm",
        "Control ID": "CEK-04",
        "Control Specification": "Use encryption algorithms that are appropriate for data protection,\n considering the classification of data, associated risks, and usability of the\n encryption technology.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n The control ownership for the encryption algorithm is “Shared (Independent”). The CSP is primarily responsible for determining and implementing the appropriate encryption algorithms in their infrastructure to ensure robust data protection. The CSP has the expertise and access to infrastructure to carry out this task, but it is the CSC’s responsibility to opt for the CSP’s encryption service and implement it as per business requirement, best practices and acceptable industry standard. \n \n Implementation Guidelines.\n The CSP is responsible for implementing encryption algorithms that are most suitable for data protection, considering the data classification, associated risks, and usability of the encryption technology. \n \n The CSP should: \n a. Offer encryption services that use algorithms appropriate for various types of data protection. These algorithms should be consistent with up-to-date industry best practices and standards \n b. Ensure that the cryptographic libraries it uses are certified to approved standards, such as FIPS 140-2\n c. Communicate clearly and transparently to CSCs about the encryption algorithms used, their strengths and weaknesses, and the types of data and risks they are suitable for\n d. Continually monitor developments in encryption technology and threats to encryption security. This includes upgrading encryption services in response to new vulnerabilities and adopting new, more secure algorithms as they become available \n e. Adopt a risk-based approach when deciding on the appropriate key size and algorithm types, considering factors such as the level of risk to data and cost-benefit analysis \n f. Offer the flexibility to developers to choose the encryption algorithm as per their application's requirement while ensuring minimum security standards \n g. Ensure the CKMS security policies protect the confidentiality, integrity, availability, and source authentication of all keys, algorithms, and metadata",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The CSC shares an independent control over the choice of encryption algorithms. While the CSP provides the cryptographic capabilities, the CSC is responsible for the proper selection and usage of these encryption services based on its specific data classification, associated risks, and business requirements. \n \n Implementation Guidelines.\n The CSC should:\n a. Familiarize itself with the encryption services provided by the CSP, including the available encryption algorithms and their appropriate use cases \n b. Select the appropriate encryption services based on the classification of its data, understanding that more sensitive data requires stronger encryption \n c. Consider the associated risks when choosing encryption algorithms. This includes understanding the potential impacts of data breaches and making informed decisions about the level of encryption required \n d. Ensure that the chosen encryption services meet all relevant compliance requirements. This may include industry-specific requirements for data protection, including reviewing and updating its use of encryption services. This also includes staying informed about developments in encryption technology and threats to encryption security, and adjusting their use of encryption services accordingly\n e. Make use of any support offered by the CSP in understanding and using the encryption services. This includes leveraging documentation, customer support, and training resources"
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Encryption Change Management",
        "Control ID": "CEK-05",
        "Control Specification": "Establish a standard change management procedure, to accommodate\n changes from internal and external sources, for review, approval, implementation\n and communication of cryptographic, encryption and key management technology\n changes.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "CSP-Owned",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n In an IaaS model, the CSP facilitates the platform for encryption and key management. The CSP oversees and independently manages changes to the cloud infrastructure, including the underlying hardware and network infrastructure. This independent handling of change management results in “Shared (Independent)” control ownership.\n \n In the PaaS model, the CSP provides the platform where the cryptographic processes occur and where cryptographic material is exposed. While it handles changes related to the platform, the change management process involves an interaction with the CSC’s application layer, creating a level of dependency. As a result, the control ownership falls under the “Shared Dependent”) category.\n \n In the SaaS model, the CSP takes on the most responsibility. It provides a full software solution, including encryption and key management. Hence, it is entirely responsible for managing changes to the software services, including the handling of cryptographic processes, making the control ownership 'CSP-Owned.’\n \n Implementation Guidelines.\n Applicable to all service models:\n Implementation guidelines should include (but not be limited to):\n a. establish a standard change management procedure for handling changes to cryptographic, encryption, and key management technologies. This includes changes resulting from internal reviews, as well as external factors such as changes to regulatory requirements or industry standards \n b. thoroughly review and approve changes before implementation, taking into account potential impact on security and compliance \n c. include provisions in change management procedures for documenting all changes, including the reasons for the changes and the expected benefits. This documentation should also include a rollback plan in case the changes need to be reversed if any risk or vulnerability is found in newly implemented changes in cryptography \n d. implement mechanisms to prevent unauthorized changes to software and systems, and to recover the system to a secure state in case unauthorized changes are detected \n e. conduct security audits to verify that the changes have been implemented correctly and have not introduced any new security risks \n f. report all audit results to the system authority, and promptly address any identified issues \n g. communicate with the CSC about any kind of change its their cryptography and key management lifecycle",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n For IaaS, the CSCs are tasked with the responsibility to manage their encryption and key management on the provided infrastructure. Any changes to the cryptographic methods or keys, at the virtual machine or application level, are independently handled by the CSCs. This results in 'Shared Independent' control ownership.\n \n In a PaaS model, while the CSP provides and manages the platform, the CSC implements their applications on it. Any changes to the encryption and key management at the application level require interaction with the provided platform, leading to an interdependence between the CSC and the CSP. Thus, the control ownership is classified as “Shared Dependent.”\n However, in a SaaS model, CSCs primarily use the software services provided by the CSPs. Any changes to the cryptographic processes are typically managed by the CSPs, including those pertaining to encryption and key management. Therefore, control ownership in this context is deemed to be 'CSP-Owned'.\n \n Implementation Guidelines.\n IaaS Customer: \n a. establish its own change management procedures for cryptographic, encryption, and key management technologies used in its systems and applications\n b. review and approve changes before implementation, considering their potential impact on security and compliance\n c. include in change documentation the reasoning behind the changes, expected benefits, and a rollback plan\n d. monitor its systems for unauthorized changes and be prepared to recover the system if necessary \n \n PaaS Customer:\n a. Similar to IaaS, establish change management procedures for its applications\n b. coordinate with the CSP to understand any changes to the platform’s cryptographic, encryption, and key management technologies that may affect applications \n \n SaaS Customer:\n a. understand and manage available settings in the SaaS application, including those related to cryptography\n b. work closely with the CSP to understand any changes that the CSP is making that may affect its use of the application\n c. have a procedure in place to review and implement changes to settings as necessary in response to changes made by the CSP"
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Encryption Change Cost Benefit Analysis",
        "Control ID": "CEK-06",
        "Control Specification": "Manage and adopt changes to cryptography-, encryption-, and key management-related\n systems (including policies and procedures) that fully account for downstream\n effects of proposed changes, including residual risk, cost, and benefits analysis.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n Both the CSP and CSC have an independent shared responsibility for this control, because both are responsible for managing and adopting changes to cryptography and key management-related systems. The CSP owns this control for Platform Managed Keys.\n \n Implementation Guidelines.\n Applicable to all service models:\n Control implementation is not service delivery model specific (IaaS, PaaS, SaaS) because the CSP should ensure that all changes to cryptography and key management-related systems be based on applicable security requirements.\n \n Implementation guidelines should include (but not be limited to):\n a. key change management cost-benefit analysis/return on investment (ROI) should be calculated for all key management-related changes\n b. every analysis should fully account for downstream effects of proposed changes, including residual risks\n c. every analysis should be reviewed and approved\n d. periodically or after a change, compare the anticipated ROI to the actual ROI\n e. significant deviation from the planned ROI should be audited\n f. report all audit results to the system authority",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, because both are responsible for managing and adopting changes to cryptography and key management-related systems. The CSC owns this control for Client Managed Keys (CMKs).\n \n Implementation Guidelines.\n Control implementation is not service delivery model specific (IaaS, PaaS, SaaS) because the CSC should ensure that all changes to cryptography and key management-related systems are guided by applicable security requirements. \n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Encryption Risk Management",
        "Control ID": "CEK-07",
        "Control Specification": "Establish and maintain an encryption and key management risk program\n that includes provisions for risk assessment, risk treatment, risk context,\n monitoring, and feedback.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, in which the encryption and key management are maintained through the enterprise risk program. The CSP owns this control for Platform Managed Keys.\n \n Implementation Guidelines.\n Applicable to all service models:\n Control implementation is not service delivery model specific (IaaS, PaaS, SaaS) because the CSP should ensure that encryption and key management are maintained through the enterprise risk program.\n \n Key risk management is the process of managing the risks to key management governance, organization, infrastructure, and activities.\n a. assess the risks of unauthorized disclosure, modification, destruction, or information loss\n b. consider the risk and consequences of information exposure for the selections of cryptoperiod\n c. evaluate the tradeoffs of manual versus automated key distribution\n d. reduce compromised key risks by:\n i. not using such keys for new encryption activities\n ii. only using keys to decrypt material previously decrypted under this key\n e. adjust the audit scope and frequency to align with the risk assessment\n f. apply algorithm strength in proportion to the risk of information exposure\n g. assess risks to operational continuity versus the risks of key material data exposure when considering key recovery",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, in which the encryption and key management are maintained through the enterprise risk program. The CSC owns this control for Client Managed Keys (CMKs).\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "CSC Key Management Capability",
        "Control ID": "CEK-08",
        "Control Specification": "CSPs must provide the capability for CSCs to manage their own data\n encryption keys.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n Both CSP and CSC have a dependent shared responsibility for this control, in which the CSP provides the capability for the CSC to manage their own data encryption keys. \n \n Implementation Guidelines.\n Applicable to all service models:\n Control implementation is not service delivery model specific (IaaS, PaaS, SaaS) because the CSP provides the capability for the CSC to manage its own data encryption keys across the service delivery models.\n \n Key management capability is the process in which the CSP provides the CSC the means to manage CSC-owned or -generated encryption keys.\n a. the CSC and CSP should agree on the definition and scope of CSC-managed keys and document it (shared responsibility) in the SLA, applicable contracts, policies, and procedures\n b. the CSP should allow the CSC’s to manage policies, procedures, and processes\n c. the CSP should provide means for the CSC to manage keys and data encryption keys\n d. the CSP should enable the CSC to manage key encryption keys or master keys used to encrypt data keys\n e. the CSP should allow the CSC to use the key management system (e.g., transactions, reporting)\n f. optionally, the CSC should provide a capability for CSC-generated master encryption keys using BYOK mechanisms",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n Both CSP and CSC have a dependent shared responsibility for this control, in which the CSC leverages CSP capability for managing their own data encryption keys. \n \n Implementation Guidelines.\n Applicable to all service models:\n Control implementation is not service delivery model specific (IaaS, PaaS, SaaS) because the CSC leverages the CSP capability for managing its own data encryption keys. \n \n Key management capability is the process in which the CSP provides the CSC the means to manage CSC-owned or -generated encryption keys.\n a. the CSC and CSP should agree on the definition and scope of CSC-managed keys and document this (shared responsibility) in the SLA, applicable contracts, policies, and procedures\n b. the CSC should leverage the CSP’s capability to manage policies, procedures, and processes\n c. the CSC should leverage the CSP’s capability to manage keys and data encryption keys\n d. the CSC should leverage the CSP capability to manage key encryption keys or master keys used to encrypt data keys\n e. the CSP should allow the CSC to use the key management system (e.g., transactions, reporting, etc.)\n f. optionally, the CSC should supply CSC-generated master encryption keys using BYOK mechanisms per the SLA."
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Encryption and Key Management Audit",
        "Control ID": "CEK-09",
        "Control Specification": "Audit encryption and key management systems, policies, and processes\n with a frequency that is proportional to the risk exposure of the system with\n audit occurring preferably continuously but at least annually and after any\n security event(s).",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n Both the CSP and CSC have an independent shared responsibility for this control, because CSP and CSC should ensure that they perform audits of encryption and key management systems, policies, and processes.\n \n Implementation Guidelines.\n Applicable to all service models:\n Control implementation is not service delivery model specific (IaaS, PaaS, SaaS Provider) because the audit of encryption and key management systems, policies, and processes apply to all.\n \n Key audit is the process of assessing the organization, governance, infrastructure, policies, procedures, and activities with regards to the use and protection of cryptographic keys.\n a. audits should be used to assess compliance with key management policies and procedures\n b. audits should be used to assess the design and effectiveness of key management controls and the control environment\n c. audits should be used to assess compliance with industry and regulatory standards (e.g., HIPAA, PCI)\n d. audits results should be reported to the key management system authority\n e. audits should be performed according to key management and risk management policies\n f. The CSP should request third-party audit/certification reports and review issues with third party vendors/CSPs.\n g. at a minimum, sensitive audit information and sensitive audit tools should be handled adhering to the same security requirements as the audited information",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP apply.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Generation",
        "Control ID": "CEK-10",
        "Control Specification": "Generate Cryptographic keys using industry accepted cryptographic\n libraries specifying the algorithm strength and the random number generator\n used.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n Both the CSP and CSC have an independent shared responsibility for this control, because both the CSP and CSC should generate cryptographic keys using industry accepted cryptographic libraries.\n \n Implementation Guidelines.\n Applicable to all service models:\n Control implementation is not service delivery model specific (IaaS, PaaS, SaaS) because both CSP and CSC should generate cryptographic keys using industry accepted cryptographic libraries.\n \n The key generation process should be cryptographically secure.\n a. keys should be generated using secure random bit generators (RBGs) and possibly other parameters, or generated based on keys that are created in this fashion\n b. key management technology and processes should be IST FIPS validated\n c. all relevant transitions/activity should be recorded (logged) in the CKMS",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n The control ownership rationale provided for the CSP apply.\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Purpose",
        "Control ID": "CEK-11",
        "Control Specification": "Manage cryptographic secret and private keys that are provisioned\n for a unique purpose.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client. The CSP owns this control for Platform Managed Keys.\n \n Implementation Guidelines.\n Applicable to all service models:\n Key distribution is the process of logically or physically transferring keys.\n a. asymmetric key pairs should be generated using a secure key generation process, ideally in a secure environment, such as an HSM\n b. the private key should be protected using strong encryption and access controls to ensure that only authorized users can access it\n c. the public key should be protected against tampering or substitution\n d. symmetric keys should also be generated using a secure key generation process and protected with strong encryption\n e. symmetric keys should be distributed using a secure channel, and access controls should be in place to restrict usage to authorized users\n f. symmetric keys should be changed regularly to minimize the risk of compromise\n g. keys should be protected at all stages of their lifecycle, including during storage, transit, and usage\n h. key distribution controls should ensure that keys are only distributed to authorized parties with a legitimate need to access the key\n i. key distribution controls should also protect against tampering, substitution, or interception during transit\n j. key distribution should also ensure that keys are available to authorized users whenever they are needed\n k. all key distribution activities should be logged and recorded in a CKMS or inventory management system",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client.\n \n The CSC owns this control for Client Managed Keys (CMKs).\n • IaaS Customer: CMK model \n • PaaS Customer: CMK where applicable\n • SaaS Customer: CMK model if available\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Rotation",
        "Control ID": "CEK-12",
        "Control Specification": "Rotate cryptographic keys in accordance with the calculated cryptoperiod,\n which includes provisions for considering the risk of information disclosure\n and legal and regulatory requirements.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client. The CSP owns this control for Platform Managed Keys.\n \n Implementation Guidelines.\n Applicable to all service models:\n Before rotating a key, ensure that all data previously encrypted with the old key version can be decrypted. Depending on organizational policies and the technology capacity of the system, old data may be automatically or manually re-encrypted with the new key version after key rotation.\n \n When rotating keys, consider the following principles:\n a. Data Decryption: Non-primary (old) keys should be used to decrypt data previously encrypted before re-encrypting the data with new keys\n b. Data Re-encryption: Old data may be re-encrypted using new keys based on organizational policy and technology capacity\n c. Algorithm Strength: This includes the strength of the encryption algorithm, the length of the key, and the mode of operation used\n d. Transactions Volume: the volume of information flow or the number of transactions that may impact the processing time required for key rotation and how frequently key rotation is necessary\n e. Data Sensitivity and Lifetime Protection: This includes how long the data needs to be protected, the sensitivity of the data, and the potential risks associated with data compromise\n f. Crypto-Security Functions: Functions such as data encryption, digital signature, and key protection may be impacted by key rotation and should be considered\n g. Key Copies Number: the number of key copies and the distribution of those copies and ensuring that all relevant key copies are updated during the rotation process\n h. Keys Rotation Logging: All key rotation activities should be logged and recorded in the CKMS or inventory management system",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client. \n \n The CSC owns this control for Client Managed Keys (CMKs).\n • IaaS Customer: CMK model\n • PaaS Customer: CMK model where applicable\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Revocation",
        "Control ID": "CEK-13",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures to revoke and remove cryptographic keys prior to the end of its established\n cryptoperiod, when a key is compromised, or an entity is no longer part of the\n organization, which include provisions for legal and regulatory requirements.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client. The CSP owns this control for Platform Managed Keys.\n \n Implementation Guidelines.\n Applicable to all service models:\n Key revocation removes keys from operational use before their expiration dates.\n a. key revocation of a symmetric key restricts the use of the key material\n b. key revocation of an asymmetric key specifically refers to the private key\n c. emergency revocation refers to when keys are lost or compromised\n d. revocation statuses should be available to all who have relied on the key\n e. Digital certificate revocation lists (CRLs) or other relevant mechanisms should be used to inform stakeholders\n f. ROI: The cost to decrypt then re-encrypt large distributed databases with a significant number of key holders. Where applicable, a two-key system should be used, one to encrypt data and another to encrypt the key that encrypts the data, in order to significantly minimize the impact of revoking keys\n g. ROI: Risk of long-term cryptoperiods versus short, and the amount of data encrypted with one key\n h. all relevant transitions/activity should be recorded (logged) in the CMKS or inventory management system",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client. The CSC owns this control for Client Managed Keys (CMKs).\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Destruction",
        "Control ID": "CEK-14",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures to destroy keys stored outside a secure environment and revoke keys\n stored in Hardware Security Modules (HSMs) when they are no longer needed, which\n include provisions for legal and regulatory requirements.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n Both the CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client. The CSP owns this control for Platform Managed Keys.\n \n Implementation Guidelines.\n Applicable to all service models:\n Key destruction removes all traces to prevent recovery by physical or electronic means.\n a. when a key is to be destroyed, all key copies should be destroyed\n b. keys should be destroyed when they are not needed to minimize risk of compromise\n c. secret and private keys should be destroyed so they cannot be recovered by any means\n d. public keys may be kept or destroyed\n e. notify stakeholders in advance of key destruction\n f. consider laws, regulations, and their retention requirements for keys and/or metadata\n g. key recovery information (KRI) should be protected against unauthorized disclosure or destruction\n h. all relevant transitions/activity should be recorded (logged) in the CMKS or inventory management system",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client. The CSC owns this control for Client Managed Keys (CMKs).\n \n Implementation Guidelines.\n Applicable to all service models:\n Key destruction removes all traces to prevent recovery by physical or electronic means.\n a. when a key is to be destroyed, all key copies should be destroyed\n b. keys should be destroyed when they are not needed, to minimize risk of compromise\n c. secrets and private keys should be destroyed so they cannot be recovered by any means\n d. private keys should always be destroyed, public keys may be kept or destroyed\n e.notify stakeholders in advance of key destruction\n f. consider laws, regulations, and their retention requirements for keys and/or metadata\n g. KRI should be protected against unauthorized disclosure or destruction\n h. all relevant transitions/activity should be recorded (logged) in the CMKS or inventory management system"
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Activation",
        "Control ID": "CEK-15",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures to create keys in a pre-activated state when they have been generated\n but not authorized for use, which include provisions for legal and regulatory\n requirements.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client. The CSP owns this control for Platform Managed Keys.\n \n Implementation Guidelines.\n Applicable to all service models:\n Activated keys are used to protect information cryptographically.\n a. pre-activated keys are activated by entering the start date of the validity/cryptoperiod\n b. keys which are not activated for use are not ready to encrypt data\n c. non-activated keys should only be used to perform proof-of-possession or key confirmation\n d. if pre-activated keys are no longer needed, they should be destroyed\n e. if there are suspicions about the integrity of a given key, it should be moved to the compromised state\n f. all relevant transitions/activity should be recorded (logged) in the CKMS or inventory management system",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client. The CSC owns this control for Customer Managed Keys (CMKs).\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Suspension",
        "Control ID": "CEK-16",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures to monitor, review and approve key transitions from any state to/from\n suspension, which include provisions for legal and regulatory requirements.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client. The CSP owns this control for Platform Managed Keys.\n \n Implementation Guidelines.\n Applicable to all service models:\n Suspended keys are not used for a period.\n a. keys may be suspended for leaves of absence or suspicion of compromise\n b. suspensions should be investigated before transitioning to activation, revocation, or replacement\n c. suspended keys should not be used to encrypt data, but they can decrypt data\n d. do not process encryption applied after the beginning of a suspension period\n e. all relevant transitions/activity should be recorded (logged) in the inventory management system (CKMS).",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client. The CSC owns this control for Client Managed Keys (CMKs).\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Deactivation",
        "Control ID": "CEK-17",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures to deactivate keys at the time of their expiration date, which include\n provisions for legal and regulatory requirements.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client. The CSP owns this control for Platform Managed Keys.\n \n Implementation Guidelines.\n Applicable to all service models:\n Deactivated keys should not be used to encrypt but can be used to decrypt.\n a. upon the expiration date, keys should not be able to encrypt data\n b. the deactivated state should transition to the destroyed state when keys are no longer needed\n c. metadata should be retained for audit purposes\n d. all relevant transitions/activity should be recorded (logged) in the CKMS or inventory management system",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client. The CSC owns this control for Client Managed Keys (CMKs).\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply.\n Applicable to all service models: For Client Managed Keys"
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Archival",
        "Control ID": "CEK-18",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures to manage archived keys in a secure repository requiring least privilege\n access, which include provisions for legal and regulatory requirements.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Independent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Independent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client. The CSP owns this control for Platform Managed Keys.\n \n Implementation Guidelines.\n Applicable to all service models:\n Key archiving places keys in long-term storage.\n a. archived key material can support the later recovery of information\n b. while archived key material may be needed in the future, the key material should be destroyed when no longer required\n c. the key recovery process should include the generation, storage, and access of the long-term storage keys used to protect backed-up and archived key information\n d. archives should be used for long-term key access\n e. the inventory system should record the storage and recovery of archived key information\n f. all relevant transitions/activity should be recorded (logged) in the CKMS or inventory management system",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n Both CSP and CSC have an independent shared responsibility for this control, depending on the scope of the resource and key ownership model available or selected by the client. The CSC owns this control for Client Managed Keys (CMKs).\n \n Implementation Guidelines.\n The implementation guidelines provided for the CSP apply.\n Applicable to all service models: For Client Managed Keys"
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Compromise",
        "Control ID": "CEK-19",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures to use compromised keys to encrypt information only in controlled circumstance,\n and thereafter exclusively for decrypting data and never for encrypting data,\n which include provisions for legal and regulatory requirements.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a shared responsibility between the CSP and the CSC. This control falls under the “Dependent” category as the execution by both parties is essential for effective security. The CSP offers encryption and key management services, and is responsible for the infrastructure that supports these services. The CSC, on the other hand, is responsible for correctly using these services to secure their data, for instance, choosing when and what data to encrypt, and managing access to encryption keys.\n \n Implementation Guidelines.\n When appropriate, the CSP should notify the CSC that keys previously used to encrypt its data have been compromised and that those keys are no longer used for encryption. \n \n IaaS Provider: \n The IaaS provider should offer mechanisms for encryption both in transit and at rest for all data, along with a key management service. The CSP should ensure that these services comply with the latest security standards and best practices. The CSP should provide tools and resources for secure key management and encryption, following best practices.\n \n PaaS Provider: \n The PaaS provider should offer platform-level encryption for data at rest and in transit, including a secure key management system. The PaaS provider should also provide the option for application-level encryption managed by the CSC. The CSP should adhere to security best practices and standards. The CSP should offer the CSC the ability to manage its own keys where feasible \n \n SaaS Provider:\n The SaaS provider should handle encryption at the application level, including key management. The provider should ensure all data at rest and in transit is encrypted. The CSP should offer CSCs the ability to manage their own keys where feasible.\n \n Applicable to all service models:\n The CSP’s policies, procedures, and processes should ensure that compromised keys await an investigation to determine disposition.\n a. perform emergency revocation when keys are lost or compromised\n b. a compromised status should be available to all who have relied on the key\n c. use Compromised Key Lists (CKL) to inform stakeholders\n d. also reflect compromised status is in the inventory management system\n e. use audits to uncover undetected compromised keys\n f. analyze events to support recovery from compromises\n g. detail the method for revoking and re-keying compromised keys\n h. use cryptoperiods to limit compromised key damage\n i. a compromised key should only be used to process data it has protected for the sole purpose of decrypting the data\n j. all transitions/activity should be recorded (logged) and the key state updated in the CKMS or inventory management system",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n This is a shared and dependent responsibility. This is because while the CSP has a responsibility to offer secure encryption and key management services, the CSC has a role in configuring and managing these services according to their specific needs and in accordance with their own policies and procedures.\n \n Implementation Guidelines.\n When appropriate, the CSP should notify the CSC that keys previously used to encrypt its data have been compromised and that those keys are no longer used for encryption. \n \n IaaS Customer:\n The CSC is responsible for implementing and managing the encryption of its data within the infrastructure provided by the CSP. The CSC should use the tools and resources provided by the CSP for key management, following best practices.\n \n PaaS Customer:\n The CSC should ensure they use the secure platform provided by the CSP effectively, including using the encryption provided at the platform level.\n The CSC may also need to implement additional encryption within the platform, depending on their needs and the services provided by the CSP.\n \n SaaS Customer:\n The CSC should ensure they use the secure software service provided by the CSP effectively, including using the encryption provided at the software level.The CSC should work with the CSP to understand how keys are managed within the software service and ensure it meets their needs and compliance requirements.\n \n Applicable to all service models:\n The CSP’s policies, procedures, and processes should ensure that compromised keys await an investigation to determine disposition.\n a. perform emergency revocation when keys are lost or compromised\n b. a compromised status should be available to all who have relied on the key\n c. use Compromised Key Lists (CKL) to inform stakeholders\n d. also reflect compromised status is in the inventory management system\n e. use audits to uncover undetected compromised keys\n f. analyze events to support recovery from compromises\n g. detail the method for revoking and re-keying compromised keys\n h. use cryptoperiods to limit compromised key damage\n i. a compromised key should only be used to process data it has protected for the sole purpose of decrypting the data\n j. all transitions/activity should be recorded (logged) and the key state updated in the CKMS or inventory management system"
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Recovery",
        "Control ID": "CEK-20",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures to assess the risk to operational continuity versus the risk of the\n keying material and the information it protects being exposed if control of\n the keying material is lost, which include provisions for legal and regulatory\n requirements.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a shared responsibility between the CSP and the CSC. This control falls under the “Dependent” category as the execution by both parties is essential for effective security. The CSP offers encryption and key management services, and is responsible for the infrastructure that supports these services. The CSC, on the other hand, is responsible for correctly using these services to secure their data, for instance, choosing when and what data to encrypt, and for managing access to encryption keys.\n \n Implementation Guidelines.\n IaaS Provider: \n The IaaS Provider should offer mechanisms for encryption both in transit and at rest for all data, along with a key management service. The CSP should ensure that these services comply with the latest security standards and best practices. The CSP should provide tools and resources for secure key management and encryption, following best practices.\n \n PaaS Provider: \n The PaaS provider should offer platform-level encryption for data at rest and in transit, including a secure key management system. The PaaS provider should also provide the option for application-level encryption managed by the CSC. The CSP should adhere to security best practices and standards. \n \n SaaS Provider: \n The SaaS provider should handle encryption at the application level, including key management. The provider should ensure all data at rest and in transit is encrypted. The CSP should offer the CSC the ability to manage its own keys where feasible.\n \n Applicable to all service models:\n Key recovery retrieves or reconstructs keys from backups or archives. The CSP’s policies, procedures, and processes should ensure:\n a. the type of key (e.g., private signature keys or symmetric data encryption keys)\n b. the application in which the key will be used (e.g., interactive communication or file storage)\n c. whether the key is owned by the local entity, another entity, or is shared\n d. the role of the entity in communication (i.e., sender or receiver)\n e. the algorithm or computation in which the key will be used\n f. all relevant transitions/activity should be recorded (logged) in the CKMS or inventory management system",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n This is a shared and dependent responsibility. This is because while the CSP has a responsibility to offer secure encryption and key management services, the CSC has a role in configuring and managing these services according to their specific needs and in accordance with their own policies and procedures.\n \n Implementation Guidelines.\n IaaS Customer:\n The CSC is responsible for implementing and managing the encryption of its data within the infrastructure provided by the CSP. The CSC should use the tools and resources provided by the CSP for key management, following best practices.\n \n PaaS Customer: \n The CSC should ensure it uses the secure platform provided by the CSP effectively, including using the encryption provided at the platform level.\n The CSC may also need to implement additional encryption within the platform, depending on their needs and the services provided by the CSP.\n \n SaaS Customer: \n The CSC should ensure it uses the secure software service provided by the CSP effectively, including using the encryption provided at the software level.\n The CSC should work with the CSP to understand how keys are managed within the software service and ensure it meets their needs and compliance requirements.\n \n Applicable to all service models:\n The implementation guidelines provided for the CSP apply."
    },
    {
        "Control Domain": "Cryptography, Encryption & Key Management",
        "Control Title": "Key Inventory Management",
        "Control ID": "CEK-21",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures in order for the key management system to track and report all cryptographic\n materials and changes in status, which include provisions for legal and regulatory\n requirements.",
        "Control Ownership by Service Delivery Model - IaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - PaaS": "Shared (Dependent)",
        "Control Ownership by Service Delivery Model - SaaS": "Shared (Dependent)",
        "CCM Implementation Guidelines v2.0  - Cloud Service Provider": "Control Ownership Rationale.\n This is a shared responsibility between the CSP and the CSC. This control falls under the “Dependent” category as the execution by both parties is essential for effective security. The CSP offers encryption and key management services, and is responsible for the infrastructure that supports these services. The CSC, on the other hand, is responsible for correctly using these services to secure their data, for instance, choosing when and what data to encrypt, and managing access to encryption keys.\n \n Implementation Guidelines.\n IaaS Provider: \n The IaaS Provider should offer mechanisms for encryption both in transit and at rest for all data, along with a key management service. The CSP should ensure that these services comply with the latest security standards and best practices. The CSP should provide tools and resources for secure key management and encryption that follow best practices.\n \n PaaS Provider: \n The PaaS provider should offer platform-level encryption for data at rest and in transit, including a secure key management system. The PaaS provider should also provide the option for application-level encryption managed by the CSC. The CSP should adhere to security best practices and standards. \n \n SaaS Provider: \n The SaaS provider should handle encryption at the application level, including key management. It should ensure all data at rest and in transit is encrypted. The CSP should offer the CSC the ability to manage its own keys where feasible.\n \n Applicable to all service models:\n The CKMS, whether manual or automated, exists to process, control, store and report key management activity. The CSP’s policies, procedures, and processes should ensure that the CKMS:\n a. captures, tracks and labels all changes in status\n b. continuously monitors for unknown cryptographic assets.\n c. generates and distributes key information\n d. acquires or generates public-key certificates\n e. backups archives and inventory key information\n f. maintains a database that maps entities to the CSP’s digital certificate or key structure\n g. provides maintenance and distribution of revoked key or digital certificate reports\n h. generates audit requests and processes audit responses\n i. crypto materials include keys, digital certificates, and HSMs\n j. verifies that key management technology and processes are FIPS validated\n k. protects the confidentiality, integrity, availability, and source authentication of all keys, digital certificates, algorithms, and metadata\n l. records (logs) all relevant transitions/activity in the inventory CKMS",
        "CCM Implementation Guidelines v2.0  - Cloud Service Consumer": "Control Ownership Rationale.\n This is a shared and dependent responsibility, because while the CSP has a responsibility to offer secure encryption and key management services, the CSC has a role in configuring and managing these services according to their specific needs and in accordance with their own policies and procedures.\n \n Implementation Guidelines.\n IaaS Customer: \n The CSC is responsible for implementing and managing the encryption of their data within the infrastructure provided by the CSP. The CSC should use the tools and resources provided by the CSP for key management, following best practices.\n \n PaaS Customer: \n The CSC should ensure they use the secure platform provided by the CSP effectively, including using the encryption provided at the platform level.\n The CSC may also need to implement additional encryption within the platform, depending on their needs and the services provided by the CSP.\n \n SaaS Customer: \n The CSC should ensure they use the secure software service provided by the CSP effectively, including using the encryption provided at the software level.\n The CSC should work with the CSP to understand how keys are managed within the software service and ensure it meets their needs and compliance requirements.\n \n Applicable to all service models:\n The implementation guidelines provided for the CSP apply."
    }
]