[
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Security and Privacy Policy and Procedures",
        "Control ID": "DSP-01",
        "Control Specification": "Establish, document, approve, communicate, apply, evaluate and maintain\n policies and procedures for the classification, protection and handling of data\n throughout its lifecycle, and according to all applicable laws and regulations,\n standards, and risk level. Review and update the policies and procedures at\n least annually.",
        "Auditing Guidelines": "1. Examine the organization's policy and procedures related to data privacy. Determine if a framework exists to ensure that the organization monitors the regulatory and legislative environment for changes applicable to the organization. Confirm whether the organization has documented the roles and responsibilities that support the management of its policy.\n 2. Determine whether policy and procedure content is sufficient to direct the compliant and lawful management of personal data and to address non-compliance.\n 3. Confirm whether policy addresses the requirement that the organization's data is used only for authorized purposes and in compliance with legislation and regulation.\n 4. Examine if the policy and procedures are reviewed on an appropriate basis.\n 5. Examine the measure(s) that evaluate(s) compliance with the organization's data privacy and security policy and determine if the measure(s) address(es) implementation of the policy/control requirement(s) as stipulated.\n 6. Examine documentation to determine if the function responsible for data privacy compliance reviews the information to determine whether the organization is compliant with current legislation and regulation.\n 7. Confirm that the procedure exists for follow-up on deviation to current legislation and regulations and is up to date."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Secure Disposal",
        "Control ID": "DSP-02",
        "Control Specification": "Apply industry accepted methods for the secure disposal of data from\n storage media such that data is not recoverable by any forensic means.",
        "Auditing Guidelines": "1. Examine the organization's procedures and technical requirements related to the secure disposal of data from storage media. Establish that this process and key controls comply with the organization's data privacy and security policy. Establish whether the organization has documented the roles and responsibilities for this process.\n 2. Select a sample of disposal requests and assess whether they have followed the process through to completion. Confirm that all evidence was formally documented and recorded.\n 3. Examine measure(s) that evaluate(s) this process and determine if the measure(s) address(es) implementation of the process/control requirement(s) as stipulated. Reviews, tests, or audits should be completed periodically by the organization to measure the effectiveness of the implemented controls and to verify that non-compliance and opportunities for improvement are identified, evaluated for risk, reported, and corrected in a timely manner.\n 4. Obtain and examine supporting documentation maintained as evidence of these metrics to determine if the office or individual responsible reviews the information and if identified issues were investigated and corrected. Determine if the individual or office is able to correct issues without the need to routinely escalate the issues to the next level of management. Examine related records to determine if the individual or office conducted any follow-ups on the deviations to verify they were corrected as intended."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Inventory",
        "Control ID": "DSP-03",
        "Control Specification": "Create and maintain a data inventory, at least for any sensitive\n data and personal data.",
        "Auditing Guidelines": "1. Examine the organization's procedures and technical requirements for the population and management of its data inventory. Establish that this process and key controls comply with the organization's data privacy and security policy. Establish whether the organization has documented the roles and responsibilities for this process.\n 2. Select a sample of entries to ensure they have been recorded correctly on the inventory. The sample must include a proportion of sensitive and personal data entries.\n 3. Assess whether management of the data inventory meets the organization's expectations.\n 4. Examine measure(s) that evaluate(s) this process and determine if the measure(s) address(es) implementation of the process/control requirement(s) as stipulated. Reviews, tests, or audits should be completed periodically by the organization to measure the effectiveness of the implemented controls and to verify that non-compliance and opportunities for improvement are identified, evaluated for risk, reported, and corrected in a timely manner.\n 5. Obtain and examine supporting documentation maintained as evidence of these metrics to determine if the office or individual responsible reviews the information and if identified issues were investigated and corrected. Determine if the individual or office is able to correct issues without the need to routinely escalate the issues to the next level of management. Examine related records to determine if the individual or office conducted any follow-ups on the deviations to verify they were corrected as intended."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Classification",
        "Control ID": "DSP-04",
        "Control Specification": "Classify data according to its type and sensitivity level.",
        "Auditing Guidelines": "1. Examine the organization's procedures and technical requirements for classifying data. Establish that this process and key controls comply with the organization's data privacy and security policy. Establish whether the organization has documented the roles and responsibilities for this process.\n 2. Establish if the organization's data classification matrix is aligned with the organization's data classification requirements.\n 3. Select a sample of data to confirm that each item has been classified appropriately.\n 4. Examine measure(s) that evaluate(s) this process and determine if the measure(s) address(es) implementation of the process/control requirement(s) as stipulated. Reviews, tests, or audits should be completed periodically by the organization to measure the effectiveness of the implemented controls and to verify that non-compliance and opportunities for improvement are identified, evaluated for risk, reported, and corrected in a timely manner.\n 5. Obtain and examine supporting documentation maintained as evidence of these metrics to determine if the office or individual responsible reviews the information and if identified issues were investigated and corrected. Determine if the individual or office is able to correct issues without the need to routinely escalate the issues to the next level of management. Examine related records to determine if the individual or office conducted any follow-ups on the deviations to verify they were corrected as intended."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Flow Documentation",
        "Control ID": "DSP-05",
        "Control Specification": "Create data flow documentation to identify what data is processed,\n stored or transmitted where. Review data flow documentation at defined intervals,\n at least annually, and after any change.",
        "Auditing Guidelines": "1. Examine the organization's procedures and technical requirements for recording data flows and that a review is carried out at least annually. Establish that this process and key controls comply with the organization's data privacy and security policy. Establish whether the organization has documented the roles and responsibilities for this process.\n 2. Select a sample of documents to check that they have been completed to the correct specifications and reviewed. \n 3. Review if data flow documentation includes assessment for accuracy, completeness, timeliness, and sustainability of data (flow).\n 4. Examine measure(s) that evaluate(s) this process and determine if the measure(s) address(es) implementation of the process/control requirement(s) as stipulated. Reviews, tests, or audits should be completed periodically by the organization to measure the effectiveness of the implemented controls and to verify that non-compliance and opportunities for improvement are identified, evaluated for risk, reported, and corrected in a timely manner.\n 5. Obtain and examine supporting documentation maintained as evidence of these metrics to determine if the office or individual responsible reviews the information and if identified issues were investigated and corrected. Determine if the individual or office is able to correct issues without the need to routinely escalate the issues to the next level of management. Examine related records to determine if the individual or office conducted any follow-ups on the deviations to verify they were corrected as intended."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Ownership and Stewardship",
        "Control ID": "DSP-06",
        "Control Specification": "Document ownership and stewardship of all relevant documented personal\n and sensitive data. Perform review at least annually.",
        "Auditing Guidelines": "1. Examine the organization's data owner process and roles and responsibilities documentation. Establish that this process and key controls comply with the organization's data privacy and security policy. Establish whether the organization has documented the roles and responsibilities for this process.\n 2. Establish that the organization maintains a source(s) of record of data owners and the records for which they are responsible. Establish that this must include personal data and sensitive data.\n 3. In the absence of a documented procedure, interview control owner(s) responsible for key staff involved in/with, and/or other relevant stakeholders impacted by the process/control requirement(s) and determine if the requirement(s) is/are understood. Evidence may be provided by observing individuals, systems and/or processes associated with data management to determine if the process requirements are generally understood and implemented consistently.\n 4. Select a range of entries to establish the information recorded is correct.\n 5. Assess whether oversight of the data ownership process meets the organization's expectations.\n 6. Examine if the documentation is reviewed on an annual basis.\n 7. Examine measure(s) that evaluate(s) this process and determine if the measure(s) address(es) implementation of the process/control requirement(s) as stipulated. Reviews, tests, or audits should be completed periodically by the organization to measure the effectiveness of the implemented controls and to verify that non-compliance and opportunities for improvement are identified, evaluated for risk, reported, and corrected in a timely manner.\n 8. Obtain and examine supporting documentation maintained as evidence of these metrics to determine if the office or individual responsible reviews the information and if identified issues were investigated and corrected. Determine if the individual or office is able to correct issues without the need to routinely escalate the issues to the next level of management. Examine related records to determine if the individual or office conducted any follow-ups on the deviations to verify they were corrected as intended."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Protection by Design and Default",
        "Control ID": "DSP-07",
        "Control Specification": "Develop systems, products, and business practices based upon a principle\n of security by design and industry best practices.",
        "Auditing Guidelines": "1. Examine whether the organization's policy, standards, and procedures create a framework which fosters a culture and expectation of “security through design.” Determine whether this content addresses the directive of the organization's culture and whether practices reflect security through design.\n 2. Examine whether the organization's governance framework, documents, controls, and metrics satisfy the organization and if its sub-processors comply with this requirement. Establish whether the organization has documented the roles and responsibilities involved.\n 3. Review the organization's data breaches log, the security incidents log, and project change failure records for examples where this requirement was not followed correctly. Further, confirm that action plans were identified and carried out.\n 4. Examine the measures that evaluate this organizational requirement and determine if the measures address implementation of process and control requirements as stipulated. \n 5. Obtain and examine supporting documentation maintained as evidence of these metrics to determine if the office or individual responsible reviews the information and if identified issues were investigated and remediated appropriately."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Privacy by Design and Default",
        "Control ID": "DSP-08",
        "Control Specification": "Develop systems, products, and business practices based upon a principle\n of privacy by design and industry best practices. Ensure that systems' privacy\n settings are configured by default, according to all applicable laws and regulations.",
        "Auditing Guidelines": "1. Examine whether the organization's policy, standards, processes, and controls create a framework that fosters a culture and expectation of “data privacy through design.” Determine whether this content addresses the directive of the organization's culture and if practices reflect data privacy through design.\n 2. Examine whether the organization's governance framework, documents, controls, and metrics satisfy the organization and whether its sub-processors comply with this requirement. Establish whether the organization has documented the roles and responsibilities involved.\n 3. Review the organization's data breaches log, the security incidents log, and project change failure records for examples where this requirement was not followed correctly. Further, confirm that action plans were identified and carried out appropriately."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Protection Impact Assessment",
        "Control ID": "DSP-09",
        "Control Specification": "Conduct a Data Protection Impact Assessment (DPIA) to evaluate the\n origin, nature, particularity and severity of the risks upon the processing\n of personal data, according to any applicable laws, regulations and industry\n best practices.",
        "Auditing Guidelines": "1. Examine procedures related to DPIA risk assessment and determine if once a requirement has been established, the organization identifies and grades the associated risks and reports and prioritizes the remediation of risks and non-compliance activities. Examine whether the DPIA process and templates align to the organization's risk methodology and taxonomy.\n 2. Establish whether the organization has documented the roles and responsibilities for this process.\n 3. Select a sample of DPIAs and examine evidence to confirm that each assessment was performed to identify associated risks. Further, confirm that any action plans were identified and carried out appropriately. Confirm that all relevant evidence was formally documented."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Sensitive Data Transfer",
        "Control ID": "DSP-10",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures that ensure any transfer of personal or sensitive data is protected\n from unauthorized access and only processed within scope as permitted by the\n respective laws and regulations.",
        "Auditing Guidelines": "1. Examine the organization's procedures and technical requirements for the secure and lawful transfer of personal data and sensitive data. Establish that this process and key controls comply with the organization's data privacy and security policy. \n 2. Establish whether the organization has documented the roles and responsibilities for this process.\n 3. Select a range of personal data transfers and a range of sensitive data transfers to confirm that each transfer adhered to the organization's policy, procedures, and controls. Confirm that all relevant evidence was formally documented."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Personal Data Access, Reversal, Rectification and Deletion",
        "Control ID": "DSP-11",
        "Control Specification": "Define and implement, processes, procedures and technical measures\n to enable data subjects to request access to, modification, or deletion of their\n personal data, according to any applicable laws and regulations.",
        "Auditing Guidelines": "1. Examine whether the organization's policy and procedures related to data privacy addresses the requirement that authorized users must be able to access, modify, or delete personal data. Establish whether the organization has processes in place to manage and respond to data access requests from data subjects. Establish whether the organization has documented the roles and responsibilities for this process.\n 2. Select a range of data changes to confirm that only authorized users are able to successfully access, modify and delete personal data. Select a sample of data access requests to establish that these were completed correctly following the organization's processes. Confirm that all relevant evidence was formally documented."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Limitation of Purpose in Personal Data Processing",
        "Control ID": "DSP-12",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures to ensure that personal data is processed according to any applicable\n laws and regulations and for the purposes declared to the data subject.",
        "Auditing Guidelines": "1. Examine whether the organization's policy and procedures related to data privacy address the requirement that data the organization is responsible for is processed lawfully and used only for the purposes stated to data subjects.\n 2. Establish whether the organization has documented the roles and responsibilities for this process.\n 3. Review the organization's data breaches and confirm that action plans were identified and carried out appropriately. Confirm that all supporting evidence was formally documented. \n 4. Review the organization's processes that inform data subjects why the organization requests this data and what it will be used for. Confirm that any organization documentation (including web page content) is subject to formal periodic review for relevance and compliance to legislation and regulation."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Personal Data Sub-processing",
        "Control ID": "DSP-13",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures for the transfer and sub-processing of personal data within the service\n supply chain, according to any applicable laws and regulations.",
        "Auditing Guidelines": "1. Examine the organization's contractual terms, procedures, roles and responsibility documents and technical requirements for the transfer of personal data and sensitive data to sub-processors and how sub-processors are to treat this data.\n 2. Establish whether the organization has documented the roles and responsibilities for this process.\n 3. Select a sample of data transfers to sub-processors to establish that the controls and reporting the sub-processor are in place and ensure that these comply with the organization's data privacy and security policy.\n 4. Examine the organization's contractual requirements for sub-processor compliance, reporting and non-compliance sanctions, and the organization's right to audit. Establish sub-processors' processes, controls and metrics to comply with those of the organization."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Disclosure of Data Sub-processors",
        "Control ID": "DSP-14",
        "Control Specification": "Define, implement and evaluate processes, procedures and technical\n measures to disclose the details of any personal or sensitive data access by\n sub-processors to the data owner prior to initiation of that processing.",
        "Auditing Guidelines": "1. Examine the organization's contractual requirements and procedures whereby sub-processors will disclose all occasions when personal or sensitive data was accessible by sub-processors prior to initiation of that processing.\n 2. Establish whether the organization has documented the roles and responsibilities for this process.\n 3. Select a sample of data transfers to sub-processors to establish that the controls and reporting the sub-processor are in place and ensure that these comply with the organization's data privacy and security policy.\n \n Note: A real-life case will be rare. Should it not be possible to follow a real-life case, a theoretical case should be tested to establish that systems, processes, and controls are operating as designed and as agreed with the sub-processor."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Limitation of Production Data Use",
        "Control ID": "DSP-15",
        "Control Specification": "Obtain authorization from data owners, and manage associated risk\n before replicating or using production data in non-production environments.",
        "Auditing Guidelines": "1. Examine the organization's procedures and technical requirements related to the use of production data in non-production environments or requests to replicate production data for use in non-production environments.\n 2. Establish whether the organization has documented the roles and responsibilities for this process.\n 3. Select a sample of requests and assess whether such requests have followed the approval and secure deployment processes through to completion. Confirm that all relevant evidence was formally documented and recorded. \n 4. Review the organization's data breaches for examples in which this requirement was not followed correctly. Further, confirm that any appropriate action plans were identified and carried out."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Retention and Deletion",
        "Control ID": "DSP-16",
        "Control Specification": "Data retention, archiving and deletion is managed in accordance with\n business requirements, applicable laws and regulations.",
        "Auditing Guidelines": "1. Examine the organization's procedures, technical requirements and other documentation for the retention, archiving and deletion of data. \n 2. Establish whether the organization has documented the roles and responsibilities for this process.\n 3. Establish that the organization maintains a source(s) of record of data types, owners, and retention periods. Select a range of entries to establish that the information recorded is correct.\n 4. Establish how the organization determines that its retention records are accurate and complete. Establish that the organization has documented its understanding of the extent of its remit in terms of its role as a supplier and the extent of its own supplier's obligations to this requirement.\n 5. Confirm that the data retention process meets the organization's requirements as detailed in policy and procedures."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Sensitive Data Protection",
        "Control ID": "DSP-17",
        "Control Specification": "Define and implement, processes, procedures and technical measures\n to protect sensitive data throughout it's lifecycle.",
        "Auditing Guidelines": "1. Examine whether the organization's policy and procedures related to data privacy address the requirement to manage and protect sensitive data throughout its lifecycle. \n 2. Establish whether the organization has documented the roles and responsibilities for this process.\n 3. Select a sample of sensitive data types to establish the systems, processes, and controls operating to manage sensitive data throughout its lifecycle. Select a sample to establish the examples following the organization's processes.\n 4. Review the organization's data breaches for examples for which this requirement was not followed correctly. Further, confirm that any relevant action plans were identified and carried out. Confirm that all relevant evidence was formally documented."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Disclosure Notification",
        "Control ID": "DSP-18",
        "Control Specification": "The CSP must have in place, and describe to CSCs the procedure to\n manage and respond to requests for disclosure of Personal Data by Law Enforcement\n Authorities according to applicable laws and regulations. The CSP must give\n special attention to the notification procedure to interested CSCs, unless otherwise\n prohibited, such as a prohibition under criminal law to preserve confidentiality\n of a law enforcement investigation.",
        "Auditing Guidelines": "1. Examine the organization's procedures and technical requirements related to personal data requests from law enforcement authorities. \n 2. Establish that processes and controls comply with the organization's data privacy and security policy. \n 3. Establish whether the organization has documented the roles and responsibilities for this process.\n 4. Select a sample of requests and assess whether such requests have followed the approvals and secure communication processes through to completion. Confirm that all evidence was formally documented. \n 5. Review the organization's data breaches for examples for which this requirement was not followed correctly. Further, confirm that relevant action plans were identified and carried out."
    },
    {
        "Control Domain": "Data Security and Privacy Lifecycle Management",
        "Control Title": "Data Location",
        "Control ID": "DSP-19",
        "Control Specification": "Define and implement, processes, procedures and technical measures\n to specify and document the physical locations of data, including any locations\n in which data is processed or backed up.",
        "Auditing Guidelines": "1. Examine the organization's procedures, technical requirements, and other documentation to direct, manage and review the records of the organization's data physical storage locations. \n 2. Establish whether the organization has documented the roles and responsibilities for this process. \n 3. Confirm that the organization’s policy and procedures include details of guidelines for the storage and processing of data within the designated countries/regions/zones/jurisdictions.\n 4. Establish that the organization maintains a source(s) of record of its physical data storage locations and is able to trace data lineage. Select a range of entries to establish that the information is recorded appropriately.\n 5. Confirm that the data storage records are accurate and complete as detailed in policy and procedures.\n 6. Establish that the organization has documented its understanding of the extent of its remit in terms of its role as a supplier and the extent of its own supplier's obligations to this requirement.\n 7. Confirm that the data storage process meets the organization's requirements as detailed in policy and procedures."
    }
]